{
  "name": "Santou Carter",
  "list_size": 0,
  "seeking": "Seeks JV partners who can refer business clients or introduce collaborative consulting opportunities. Limited profile data suggests openness to cross-referral arrangements with aligned professionals in business or advisory areas.",
  "content_platforms": {
    "youtube": "https://www.youtube.com/watch?v=CjZE2cmVisA",
    "facebook": "https://www.facebook.com/shantel.carter.98/",
    "apple_podcast": "https://podcasts.apple.com/rs/podcast/cartier-santos-history-and-evolution/id1667308909?i=1000688510835"
  },
  "audience_engagement_score": 0.6000000000000001,
  "website": "https://www.matchmaker.fm/podcast-guest/santou-carter-f8b883",
  "linkedin": "https://uk.linkedin.com/in/santou-eve-carter",
  "_cache_schema_version": 2,
  "what_you_do": "Santou Carter is an international speaker offering hope of re-engagement with life across all stages of life's losses. She guides people through the trauma of loss and grief by bringing the pain into the light to release it.",
  "who_you_serve": "Santou specializes in terminal diagnosis right through to after death grief care, including suicide prevention. She has worked professionally in statutory services, charities and private practice supporting hundreds of families, individuals, groups and workplace staff.",
  "social_proof": "Santou is a published author, including two books called Navigating Loss Through the First Year of Bereavement and Supporting Someone Grieving in the Workplace. She has 25 years of combined experience as a registered Psychotherapist, Certified Grief Educator, Healthcare Chaplain & Public Theologian, Group Facilitator, Accountability and Voice/Performance Coach.",
  "signature_programs": "Santou serves her clients experiencing loss by moving them through Stages of Hope™ using her unique therapeutic-spiritual model called the S.T.E.E.R.™ approach. She also leads seasonal and regular sacred narrative groups.",
  "niche": "grief, loss, trauma",
  "company": "Grief Support Services Global",
  "tags": [
    "life coaching",
    "self-improvement",
    "courses",
    "kids & family",
    "religion & spirituality"
  ],
  "audience_type": "individuals, families, workplace staff",
  "business_focus": "Santou Carter is a trauma and grief practitioner who specializes in terminal diagnosis through to after death grief care, including suicide prevention.",
  "service_provided": "life coaching, self-improvement, courses, grief support, spiritual guidance",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T03:19:00.187374"
}