{
  "name": "Timothy Stuetz",
  "company": "Transformations",
  "list_size": 3960,
  "offering": "Book Writing Coach, Children and Family, Coach Certification, Compilation Books, Group Coaching, Intuition Coaching, Life Coaching Certification, Mastermind Groups, Speaking Opportunities, Spiritual Coaching",
  "content_platforms": {
    "apple_podcast": "https://podcasts.apple.com/us/podcast/timothy-stuetz-developing-a-childs-inner-genius-3/id1524660255?i=1000606507162",
    "linkedin": "https://www.linkedin.com/posts/timothy-stuetz_the-best-things-in-life-are-free-a-freebie-activity-7079171620442955776-8pXx",
    "facebook": "https://www.facebook.com/SaintLukesCancerInstitute/posts/dr-timothy-pluard-is-a-man-on-a-missionas-medical-director-at-saint-lukes-cancer/1146181839189084/",
    "youtube": "https://www.youtube.com/watch?v=hFLPs2xcZXM"
  },
  "audience_engagement_score": 0.6000000000000001,
  "website": "https://www.timothystuetz.com/",
  "linkedin": "https://www.linkedin.com/in/timothy-stuetz",
  "_cache_schema_version": 2,
  "what_you_do": "Timothy Stuetz is a transformational coach, author, and creator of educational programs and resources for children and families.",
  "who_you_serve": "Timothy serves children, families, spiritual seekers, personal development enthusiasts, and others looking to live more fulfilling and successful lives.",
  "seeking": "The website does not explicitly state any partnerships or collaborations Timothy is actively seeking.",
  "social_proof": "Timothy is considered by many to be the #1 fairy tale creator, with over 40 years of experience in meditation, energy practices, teaching, and serving tens of thousands of people. He has received praise from notable individuals such as Maureen Moss and Shondra Jepperson.",
  "signature_programs": "Timothy's signature programs include The Magical Miracle of You, Sacred Parent Magical Child, Sacred Sciences Alchemy Academy, Fairy Tales of the Heart, Power Animal Frolics, Raising Brilliant Children, and the Bliss Beary Bear's BE-YOND-A Book Club.",
  "booking_link": "The website does not provide a direct booking link.",
  "niche": "transformational coaching, children's education, family development",
  "phone": "The website does not display a business phone number.",
  "tags": [
    "transformational coaching",
    "children's education",
    "family development",
    "spiritual enlightenment",
    "personal development"
  ],
  "audience_type": "B2C, families, spiritual seekers, personal development enthusiasts",
  "business_focus": "Timothy Stuetz offers transformational coaching, educational programs, and resources to help children, families, and individuals live more fulfilling and successful lives.",
  "service_provided": "transformational coaching, children's education programs, family development resources, spiritual enlightenment coaching, personalized empowerment poems",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T01:31:31.375199"
}