{
  "name": "Debbie Rose",
  "list_size": 0,
  "seeking": "Debbie Rose, positioned as a general business consultant, likely seeks JV partners who can refer clients needing consulting or professional services. Partners with established audiences of business owners or entrepreneurs would be most valuable. A co-promotion or referral arrangement with complementary service providers would extend her reach.",
  "offering": "Specializes in Debbie solutions and services with expert guidance",
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/in/drose22",
    "facebook": "https://www.facebook.com/debbie.rose.71/",
    "spotify_podcast": "https://open.spotify.com/track/7oZe1L4jk82Ue06DiznYm9"
  },
  "audience_engagement_score": 0.4,
  "website": "https://www.deborahcolleenrose.com/deborah-colleen-rose",
  "linkedin": "https://www.linkedin.com/in/deborahrose",
  "_cache_schema_version": 2,
  "what_you_do": "Deborah is a lifetime entrepreneur whose experience and expertise lie in areas as a private investigator, paralegal, mediator, life coach, handwriting therapist and a certified hypnosis practitioner.",
  "who_you_serve": "Deborah has had the opportunity to speak and teach to thousands of family members and professionals.",
  "social_proof": "Deborah is a contributing writer to Chicken Soup of the Soul: Children with Special Needs. Deborah has over 30 books available on amazon.com and helps others publish and promote their own books as well.",
  "signature_programs": "Accredited Spiritual Coach - (IAOTH), Accredited Communications Coach - (IAOTH) & CFC, Accredited Somatic Healing Coach - (IAOTH), Accredited Grief Coach - (IAOTH), Accredited Communication Coach - CFC, Accredited Spiritual Coach - (IAOTH), Certified Master of Theology and Spirituality - (IAOTH), Certified in Hoʻoponopono, Licensed Winslow Profiles Director, Licensed/Certified Coach Trainer and Curriculum Developer, Licensed/Certified Hypnosis Practitioner, Licensed NLP Master Practitioner, Licensed Handwriting Formation Therapist/Trainer, National Trainer- Family Programs – Mental Health Field, Reiki Master, Developer of C.H.U.N.K. – Using Your Core Emotional Response",
  "niche": "spiritual coaching, life coaching, mental health",
  "company": "DCR Enterprises",
  "tags": [
    "private investigator",
    "paralegal",
    "mediator",
    "life coach",
    "handwriting therapist",
    "hypnosis practitioner",
    "public speaker",
    "author"
  ],
  "audience_type": "family members, professionals",
  "business_focus": "Deborah is a lifetime entrepreneur whose experience and expertise lie in areas as a private investigator, paralegal, mediator, life coach, handwriting therapist and a certified hypnosis practitioner.",
  "service_provided": "private investigations, paralegal services, mediation, life coaching, handwriting therapy, hypnosis, public speaking, writing/publishing",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T03:27:43.169654"
}