{
  "name": "s s",
  "company": "SSS Coach - The Gain Enabler",
  "list_size": 0,
  "seeking": "Seeks JV partners who can refer business clients needing professional services or innovative solutions. Limited profile data suggests openness to cross-referral arrangements with professionals in aligned business service areas.",
  "content_platforms": {
    "youtube": "https://www.youtube.com/@startingstrength"
  },
  "audience_engagement_score": 0.55,
  "social_reach": 311000,
  "website": "https://www.sss.coach",
  "linkedin": "https://www.linkedin.com/in/sangeetasumesh",
  "_cache_schema_version": 2,
  "email": "sss@sss.coach",
  "phone": "91-9176682844",
  "what_you_do": "CFO turned Business, Leadership & Team Coach. Global keynote speaker and bestselling author specializing in maximizing potential, performance, and profits for corporate leaders and teams.",
  "who_you_serve": "Corporate leaders, senior management teams, aspiring C-suite executives, entrepreneurs, and women managers seeking leadership growth.",
  "niche": "Business & Leadership Coaching",
  "offering": "Financial growth workshops, leadership development programs, executive coaching, profit strategy design, OKR implementation, personal branding, keynote speaking",
  "signature_programs": "FLY HIGH Executive Leadership Coaching, Building High Performance Teams Workshop, Finance for Business Decision Making, Designing Profit Strategy, What The Finance (book), Get High (book), Where's The Moolah? (book)",
  "service_provided": "Business Coaching, Leadership Coaching, Team Coaching, Executive Coaching, Financial Growth Workshops, Keynote Speaking, Corporate Training, OKR Implementation, Personal Branding",
  "business_focus": "Enabling high performance and enhancing financial growth for corporate leaders and teams through coaching, workshops, and speaking.",
  "audience_type": "B2B, corporate leaders, senior management",
  "social_proof": "Chartered Accountant, Harvard Business School executive education, ICF PCC credential, TEDx speaker, Outstanding Professional Award by FICCI, Leading Woman CFO in India, 100 Inspiring Authors of India, Value Creator Award by ICAI. Clients include Ford, Cisco, BMW, Andritz, Murugappa Group, TransUnion, RPG Group, Tesco.",
  "tags": [
    "business coaching",
    "leadership development",
    "financial growth",
    "executive coaching",
    "keynote speaker",
    "corporate training",
    "cfo"
  ],
  "booking_link": "",
  "_owl_enriched": true,
  "_owl_timestamp": "2026-02-17T23:35:50.632556",
  "_source": "manual_pdf_extraction"
}