{
  "name": "Calvin Chipman",
  "list_size": 0,
  "seeking": "Calvin is a general business consultant targeting entrepreneurs and business professionals, suggesting he seeks JV partners who have an existing audience of small business owners or startups and can refer clients needing strategic advisory work. He would benefit from partners in adjacent services—such as bookkeeping, marketing, or legal—who can cross-refer clients. A revenue-share referral arrangement with a complementary service provider is the most probable fit.",
  "who_you_serve": "Boys and men ages 8-35, fathers, families, couples, athletes, schools, and community organizations.",
  "what_you_do": "Dr. Calvin T. Mann, known as the National Encourager, provides fatherhood legacy training, coaching and life skills for athletes, in-school leadership development for boys, and couples guidance.",
  "business_focus": "Encouraging and empowering boys, men, fathers, and families through training, speaking, and coaching programs.",
  "audience_type": "B2C",
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/in/calvin-chipman-659ba211a",
    "youtube": "https://www.youtube.com/watch?v=ewJRdNxK2Ng",
    "instagram": "https://www.instagram.com/crimewatchatlanta/p/DHJQytrs708/",
    "facebook": "https://m.facebook.com/westhantshistoricalsociety/posts/an-invitation-for-the-historical-commemoration-of-isaac-chipman-on-june-27-at-63/1170069701799367/"
  },
  "audience_engagement_score": 0.65,
  "website": "https://calvintmann.com/services/",
  "_cache_schema_version": 2,
  "_phase2_enriched": true,
  "_phase2_date": "2026-02-18T06:58:42.352361",
  "offering": "Speaking, facilitation, panel participation, fatherhood workshops, athletic coaching and life skills sessions, in-school leadership programs, and couples guidance.",
  "niche": "Fatherhood & Youth Development",
  "bio": "Dr. Calvin T. Mann, widely known as the National Encourager, is dedicated to inspiring and motivating individuals across the nation. He is a servant leader with a solution-focused and action-oriented vision for change, encouraging boys and supporting fathers. Based in Michigan, his mission of fatherhood value, developing boys, and providing life skills and coaching is carried out locally and throughout the country.",
  "tags": [
    "fatherhood training",
    "youth development",
    "motivational speaking",
    "life skills coaching",
    "athletic coaching",
    "leadership development",
    "couples guidance"
  ],
  "service_provided": "Fatherhood Legacy Training, Coaching & Life Skills for Athletes, In-School Leadership Development for Boys, Couples Guidance, Speaking, Panel Facilitation",
  "network_role": "Educator",
  "email": "calvin@calvintmann.com",
  "phone": "313-590-1142",
  "signature_programs": "Fatherhood Legacy Training, EMIY (Every Man Is Yours/Future Leaders program), Introduction to Legacy Workshops"
}