{
  "name": "Darren Starwynn",
  "company": "Lightworker Ministry",
  "list_size": 0,
  "offering": "Business Coaching, Coach Certification, Group Coaching, Intuition Coaching, Life Coaching Certification, Spiritual Coaching",
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/in/darrenstarwynn",
    "apple_podcast": "https://podcasts.apple.com/ca/podcast/awakening-your-inner-healer-with-darren-starwynn/id1639945717?i=1000586210028"
  },
  "website": "https://lightworkerministry.com/heal-and-transform/",
  "_cache_schema_version": 2,
  "what_you_do": "Dr. and Reverend Darren Starwynn is an internationally-known \"healer to the healers\", author and innovator. He is known as a \"quantum catalyst\" because so many people have had major positive shifts in their lives and careers after receiving just a few individual sessions with him or participating in his group events.",
  "who_you_serve": "His passion is empowering healthcare professionals and healers to claim their higher healing abilities for themself and others while expanding their sense of abundance.",
  "social_proof": "He has written three groundbreaking books, led hundreds of workshops and seminars, invented several vibrational devices used worldwide and helped develop advanced mind-body healing systems. Thousands of people have been directly or indirectly touched by Darren's offerings, and he has inspired many colleagues to expand the scope of their work to include energy medicine and consciousness-based healing systems.",
  "signature_programs": "Awaken the Avatar Within, Heal and Transform 60-Day Program",
  "niche": "energy healing, consciousness-based healing",
  "tags": [
    "energy healing",
    "consciousness-based healing",
    "quantum catalyst"
  ],
  "audience_type": "healthcare professionals, healers",
  "business_focus": "Empowering healthcare professionals and healers to claim their higher healing abilities and expand their sense of abundance.",
  "service_provided": "individual healing sessions, group events, books, workshops, seminars",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T02:11:25.482685"
}