{
  "name": "Trevor James",
  "company": "Trevor James, LLC",
  "list_size": 2470,
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/in/iamtrevorjames",
    "facebook": "https://www.facebook.com/trevordjames/",
    "youtube": "https://www.youtube.com/@trevorjameson."
  },
  "jv_history": [
    {
      "partner_name": "- YouTube",
      "format": "endorsement",
      "source_quote": "We at Just Flutes stock the full range of Trevor James flutes so you can be confident in finding an instrument that's perfect for you.\\n\\n\\n\\nModels featured in ... flute: https://justflut.es/3ll\\n\\n\\",
      "source_url": "https://www.youtube.com/watch?v=GoKclSxdoRU"
    }
  ],
  "audience_engagement_score": 0.6000000000000001,
  "website": "https://theclose.com/author/trevor-james/",
  "_cache_schema_version": 2,
  "what_you_do": "The website does not explicitly state Trevor James' primary business or service.",
  "who_you_serve": "The website does not explicitly state Trevor James' target audience.",
  "seeking": "The website does not explicitly state any partnerships or collaborations that Trevor James is actively looking for.",
  "offering": "The website does not explicitly state what Trevor James offers to partners or collaborators.",
  "social_proof": "The website does not provide any notable credentials, certifications, or audience size for Trevor James.",
  "signature_programs": "The website does not mention any named courses, books, frameworks, or certifications associated with Trevor James.",
  "booking_link": "The website does not provide a calendar booking URL for Trevor James.",
  "niche": "The website does not explicitly state Trevor James' primary market niche.",
  "phone": "The website does not display a business phone number for Trevor James.",
  "audience_type": "The website does not explicitly state the type of audience Trevor James serves.",
  "business_focus": "The website does not provide a clear statement of Trevor James' primary business focus.",
  "service_provided": "The website does not explicitly list the specific services provided by Trevor James.",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T01:37:53.309963"
}