{
  "name": "Angela OBrien",
  "list_size": 0,
  "seeking": "Seeks JV partners who can refer professional clients needing consulting or business development services. Limited profile data suggests openness to cross-referral arrangements with professionals in aligned business service areas.",
  "what_you_do": "Founder and co-owner of Esteem Lingerie and the Esteem Bra Fitting Academy, providing business coaching, consulting, and bra fitter training for the lingerie industry.",
  "who_you_serve": "Lingerie shop owners and staff seeking specialized bra fitting training, business coaching, and operational improvement.",
  "niche": "Lingerie retail training",
  "signature_programs": "Esteem Bra Fitting Academy, free masterclass on building resilience and preparing for unforeseen challenges",
  "revenue_tier": "emerging",
  "company": "Esteem Bra Fitting Academy",
  "service_provided": "Bra fitter training programs, business coaching, business consulting, masterclasses, staff training, strategic planning, process alignment",
  "business_size": "small_team",
  "tags": [
    "bra fitting",
    "lingerie retail",
    "business coaching",
    "staff training",
    "business consulting",
    "resilience",
    "luxury lingerie"
  ],
  "business_focus": "Training and coaching lingerie businesses in bra fitting, operations, growth, staff training, and strategic planning.",
  "audience_type": "B2B",
  "content_platforms": {
    "youtube": "https://www.youtube.com/watch?v=fuDeZHTjPt8",
    "apple_podcast": "https://podcasts.apple.com/ng/podcast/esthetician-podcast-business-tips-for-beauty-professionals/id1759046667"
  },
  "audience_engagement_score": 0.55,
  "website": "https://www.esteembrafittingacademy.com/post/embracing-resilience-angela-o-brien-s-journey-from-crisis-to-innovation",
  "_cache_schema_version": 2,
  "_phase2_enriched": true,
  "_phase2_date": "2026-02-18T07:00:10.484918",
  "offering": "Business coaching and consulting specializing in lingerie retail, bra fitter training programs, and masterclasses on building business resilience.",
  "bio": "Angela O'Brien is the founder and co-owner of Esteem Lingerie and the Esteem Bra Fitting Academy in West Kelowna, British Columbia, Canada. She is a Certified Business Coach and Consultant with 25 years of experience, including over 19 years in the luxury lingerie industry. Her background includes a decade in the corporate insurance industry where she developed skills in business development and coaching.",
  "network_role": "Educator"
}