{
  "name": "Jeffrey E. Bergerwww.jeffreyeberger.biz",
  "list_size": 38476,
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/in/jeffrey-trageser-msn-rn-cptc-432b5175",
    "apple_podcast": "https://podcasts.apple.com/us/podcast/the-infrastructure-of-jeffrey-epsteins-power/id1548604447?i=1000749573912"
  },
  "website": "https://jeffreyeberger.biz/",
  "linkedin": "https://www.linkedin.com/in/jeffreyeberger",
  "_cache_schema_version": 2,
  "what_you_do": "Certified Holistic Coach and Global Ambassador for an innovative global company, taking a 'Finance First' approach to personal well-being by educating people on digital currency, blockchain, real estate tech, financial tech, education tech, AI, and metaverse opportunities.",
  "who_you_serve": "Global-minded individuals seeking to go from financial fatigue to financial freedom through digital technologies and new wealth-building approaches.",
  "offering": "Education on digital currency, blockchain, real estate tech, ed tech, fin tech, AI, and metaverse opportunities; hosts five monthly webinars on 'The Future of True Wealth | A Digital Revolution'.",
  "social_proof": "Certified Holistic Coach; holds a doctoral title (Dr.); featured in Hounds of Business interview; associated with an ed tech AI metaverse platform with 500,000+ end users and 250 schools.",
  "signature_programs": "The Future of True Wealth | A Digital Revolution (webinar series), ED Tech AI Metaverse Platform",
  "niche": "Digital wealth education",
  "company": "Jeffrey Edward Berger Abundance In Optimum Wellness",
  "tags": [
    "digital currency",
    "blockchain",
    "holistic coaching",
    "financial freedom",
    "ed tech",
    "ai",
    "metaverse"
  ],
  "audience_type": "B2C",
  "business_focus": "Empowering individuals to achieve financial freedom through education on digital technologies including blockchain, AI, metaverse, and fintech opportunities.",
  "service_provided": "Holistic coaching, financial education webinars, digital wealth education, global ambassador services",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T00:34:36.706576"
}