{
  "name": "Scott",
  "list_size": 30000,
  "content_platforms": {
    "youtube": "https://www.youtube.com/channel/UCDfnam79n2tXXumz9i7jnIA",
    "spotify_podcast": "https://open.spotify.com/artist/0Y5tJX1MQlPlqiwlOH1tJY",
    "facebook": "https://www.facebook.com/scottforflorida/"
  },
  "audience_engagement_score": 0.6000000000000001,
  "website": "https://scottaaron.net/",
  "_cache_schema_version": 2,
  "what_you_do": "Business coach specializing in LinkedIn strategy, helping entrepreneurs and coaches generate organic leads, build authentic connections, and grow their businesses using LinkedIn.",
  "who_you_serve": "Entrepreneurs, business coaches, consultants, online business owners, and network marketers seeking organic lead generation through LinkedIn.",
  "offering": "LinkedIn optimization training, one-on-one coaching, group mastermind programs, and proven systems for organic lead generation and personal brand building.",
  "social_proof": "3 best-selling books, over 2,000 clients served, 500+ written testimonials on LinkedIn, over 23 years as an entrepreneur, trainer for several top financial firms, internationally acclaimed and award-winning network marketer, featured in MarketWatch, Daily Herald, Pittsburgh Post-Gazette, Buffalo News, AZ Central, RFD TV, WBOC, Suncoast News Network. Company has generated over 3 million in revenue on LinkedIn.",
  "signature_programs": "LinkedIn Accelerator Virtual Program, One on One Coaching (6-week intensive), Expert Authority Mastermind (year-long program), The LinkedIn Book for Network Marketers (best-selling book), Networking and Marketing Made Simple (top ranking podcast), The Perfect Profile (free guide)",
  "booking_link": "https://scottaaron.as.me/schedule.php",
  "niche": "LinkedIn lead generation",
  "tags": [
    "linkedin",
    "lead generation",
    "business coaching",
    "network marketing",
    "personal branding",
    "organic marketing",
    "online business"
  ],
  "audience_type": "B2B, coaches, consultants, online business owners, network marketers",
  "business_focus": "Teaching entrepreneurs and coaches how to use LinkedIn to generate consistent organic leads and grow their businesses through authentic connection.",
  "service_provided": "LinkedIn profile optimization, one-on-one business coaching, group coaching mastermind, online courses, podcasting, speaking, book authorship",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T00:35:50.308710"
}