{
  "name": "Ligia Gutierrez",
  "company": "Love Your Mission Leadership",
  "list_size": 0,
  "offering": "Career Coaching & Consulting",
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/in/ligiagutierrez",
    "youtube": "https://www.youtube.com/watch?v=z2_bA9fxj-M"
  },
  "audience_engagement_score": 0.55,
  "website": "https://www.loveyourmission.com/aboutme",
  "linkedin": "https://www.linkedin.com/in/ligiagutierrez",
  "_cache_schema_version": 2,
  "what_you_do": "I am dedicated to helping individuals and organizations unlock their potential, align with their values, and thrive in every aspect of their professional and personal lives.",
  "who_you_serve": "For individuals, I create a supportive and encouraging space where you can reflect, grow, and take actionable steps toward your goals. For organizations, I partner with managers and leadership teams to cultivate collaboration, connection, and a sense of belonging.",
  "social_proof": "I am proud to have led large and small workshops, retreats, conferences, events, and training for staff, volunteers, clients, youth leaders, and college-age young adults. Before stepping down from my 22-year career as a nonprofit executive, I was the first Latin American to be the YMCA Youth & Government State Director for the state of Texas civic engagement program. I transformed the lives of thousands of youth leaders and created a strong staff and volunteer community across the state and nationally.",
  "signature_programs": "Certified in Leading & Coaching Others, Money Breakthrough Coach, Master of Science In Management & Leadership, and Bachelor in Social Work. Trainer in multiple subjects, including Facilitation Skills, Deepening the Diversity Initiative, Cultural Lenses: Building Relationships Through Cultural Lenses, Adult-Learning Concepts, Peer Mediation Trainer, Program Management & Development, Training Others, Grant Writing Faculty, and Fiscal Management & Budgeting.",
  "booking_link": "https://calendly.com/ligialgutierrez/gain-clarity-chat",
  "niche": "leadership coaching, career coaching",
  "tags": [
    "leadership coaching",
    "career coaching",
    "organizational development",
    "team building",
    "executive coaching"
  ],
  "audience_type": "individuals, organizations, managers, leaders",
  "business_focus": "Helping individuals and organizations unlock their potential, align with their values, and thrive in every aspect of their professional and personal lives.",
  "service_provided": "leadership coaching, career coaching, organizational development, team building, executive coaching",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T02:05:59.286282"
}