{
  "name": "Yolanda Davis",
  "company": "Yolanda Denise",
  "linkedin": "http://www.linkedin.com/in/yolanda-davis-5b1a13345",
  "list_size": 150,
  "seeking": "Yolanda Davis, an associate at Yolanda Denise in a general business and entrepreneur context, likely seeks JV partners who can provide referrals or co-promote services within the business and entrepreneurship community. Partners with established audiences of small business owners or early-stage entrepreneurs would be natural matches for audience-sharing or referral arrangements. More specific niche data would be needed to target the right collaboration structure precisely.",
  "who_you_serve": "Women who are ready to pivot—whether they feel stuck, ready to transition out of outdated roles, or want more satisfaction for their lives.",
  "what_you_do": "Professional speaking, self-development, and training platform dedicated to empowering individuals through transformational coaching, dynamic workshops, and life-shifting seminars.",
  "business_focus": "Empowering individuals through transformational speaking, coaching, and self-development using The PIVOT Decision™ Framework.",
  "audience_type": "Entrepreneurs",
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/posts/yolandadavisoverstreet_apa-los-angeles-presents-black-history-month-activity-7297756895728021505-1zcK",
    "facebook": "https://www.facebook.com/100034607567124/",
    "spotify_podcast": "https://open.spotify.com/artist/47opbYEKDjXnRk9uLscp11"
  },
  "jv_history": [
    {
      "partner_name": "How To L.A. - How I Got Started: Mobility Justice Strategist Yolanda… | Yolanda Davis-Overstreet, M.",
      "format": "endorsement",
      "source_quote": "anda Davis-Overstreet, M.A.’s Post Yolanda Davis-Overstreet, M.A. Mobility Justice Strategist, Socially-Justice Based Film Director / Storyteller\n\n1y\n\n- Report this post ... - [**BIKING WHILE BLACK FI",
      "source_url": "https://www.linkedin.com/posts/yolandadavisoverstreet_how-to-la-how-i-got-started-mobility-activity-7183979339804286976-dZuK"
    }
  ],
  "audience_engagement_score": 0.4,
  "website": "https://thepivotdecision.com/",
  "_cache_schema_version": 2,
  "_phase2_enriched": true,
  "_phase2_date": "2026-02-18T07:02:12.519872",
  "niche": "Transformational Speaking",
  "bio": "Yolanda Davis, Hon. D., is a motivational keynote speaker, published author, coach, and U.S. Air Force veteran. She is the visionary behind The PIVOT Decision™ and I Made the Pivot framework. Recognized as a recipient of the President's Lifetime Achievement Award and an Honorary Doctorate of Humanitarianism.",
  "tags": [
    "transformational speaker",
    "author",
    "coach",
    "air force veteran",
    "personal development",
    "mindset mastery",
    "veteran advocate"
  ],
  "service_provided": "Motivational keynote speaking, transformational coaching, workshops, seminars, consulting",
  "network_role": "Educator",
  "signature_programs": "The PIVOT Decision™ Framework, I Made the Pivot, No Satan Not This Time (book), The PIVOT Decision featured in The Change Vol 22, The F in Your Finances"
}