{
  "name": "Self Improvement, Service Prov",
  "company": "Collaborative Social Marketing",
  "website": "https://socialbuzzclub.com",
  "list_size": 400,
  "what_you_do": "Ben Gioia helps individuals leverage their books to attract leads, clients, and partners, even before the books are published or finished.",
  "who_you_serve": "The target audience includes aspiring authors, entrepreneurs, and professionals looking to establish themselves as experts or thought leaders in their fields.",
  "niche": "self improvement",
  "signature_programs": "How To Leverage Your Book and Stand Out As An Expert, Authority, or Thought Leader",
  "revenue_tier": "emerging",
  "service_provided": "speaking, consulting",
  "current_projects": "Free webinar on leveraging books for business success.",
  "business_size": "small_team",
  "tags": [
    "self improvement",
    "book marketing",
    "lead generation",
    "expert positioning",
    "entrepreneurship"
  ],
  "bio": "Three-time international bestselling author, trained over 100 millionaires, created the first mindfulness program for The ALS Association, helped a Fortune 100 company with a mindfulness video game.",
  "business_focus": "Ben Gioia helps individuals leverage their books to attract leads, clients, and partners, even before the books are published or finished. (self improvement)",
  "audience_type": "The target audience includes aspiring authors, entrepreneurs, and professionals looking to establish",
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/pulse/how-should-brands-connect-consumer-communities-mark-schaefer-z4tbe",
    "youtube": "https://www.youtube.com/watch?v=ocCEtt1eM_s"
  },
  "jv_history": [
    {
      "partner_name": "How can you use digital media to collaborate with other social impact organizations?",
      "format": "endorsement",
      "source_quote": "can you use digital media to collaborate with other social impact organizations? Powered by AI and the LinkedIn community\n\n### 1\n\n Identify your goals and values \n\n### 2 ... Digital media is a powerfu",
      "source_url": "https://www.linkedin.com/advice/1/how-can-you-use-digital-media-collaborate-other-social-stb9c"
    },
    {
      "partner_name": "How do you build and engage an online community around your social enterprise?",
      "format": "endorsement",
      "source_quote": "do you build and engage an online community around your social enterprise? ... Building a strong online community for a social enterprise involves authenticity and engagement. ... ``\n## 4Foster intera",
      "source_url": "https://www.linkedin.com/advice/0/how-do-you-build-engage-online-community-around"
    },
    {
      "partner_name": "What are some successful social media collaborations between customer service and marketing teams?",
      "format": "endorsement",
      "source_quote": "are some successful social media collaborations between customer service and marketing teams? ... Social media is not only a powerful tool for marketing, but also for customer service. When these two",
      "source_url": "https://www.linkedin.com/advice/3/what-some-successful-social-media-collaborations-bfa5c"
    }
  ],
  "audience_engagement_score": 0.55,
  "_cache_schema_version": 2
}