{
  "name": "Ersula Odom",
  "company": "Sula Too Publishing",
  "list_size": 1000,
  "website": "https://boldjourney.com/meet-ersula-k-odom/",
  "_cache_schema_version": 2,
  "what_you_do": "As CEO of Sula Too LLC, Ersula K. Odom is on a mission to preserve cultural history in any form possible. As such she is a publisher, legacy wall designer, a 10-time author, and living history performer.",
  "who_you_serve": "Ersula combines research, life and professional experiences of rural living, college life, fortune 500 corporate management, spirituality, family, entrepreneurship, sales, genealogy, and publishing, to deliver relative multi-generational and multi-cultural products and services.",
  "seeking": "The word is getting out and we are growing. We need single focused publisher support providers who complete tasks or operate departments.",
  "offering": "Ersula brings to the table 20 years of computer technology and systems training and documentation management. These skills permit her to offer low cost options to new authors.",
  "social_proof": "Interesting facts. She portrayed Dr. Mary McLeod Bethune at a 2012 DNC event in NC, in Washington for the Capitol Historical Society's celebration event of Dr. Bethune's statue installation in 2022, and of her performance at FAMU was mentioned in the Wall Street Journal.",
  "signature_programs": "Books by Ersula K Odom: At Sula's Feet, The Doris Ross Reddick Story, Miss Lizzy's Story, African Americans of Tampa, Pamala McCoy-A Shero's Story, Rolanda McDuffie – Living Life as Intended, Create Your Signature Book in A Weekend, Rogers Park Golf Course (18 holes of history), Tanya (Tanya Martin-Pekel)",
  "booking_link": "calendly.com/Ersula",
  "niche": "cultural history, publishing, legacy walls",
  "tags": [
    "publisher",
    "legacy walls",
    "author",
    "living history performer",
    "genealogy"
  ],
  "audience_type": "multi-generational, multi-cultural",
  "business_focus": "Ersula K. Odom is on a mission to preserve cultural history in any form possible.",
  "service_provided": "publishing, legacy wall design, author, living history performer",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T01:48:41.613038"
}