{
  "name": "Rahul",
  "list_size": 0,
  "content_platforms": {
    "youtube": "https://www.youtube.com/@rahulgandhi",
    "facebook": "https://www.facebook.com/officialrahul/"
  },
  "audience_engagement_score": 0.6000000000000001,
  "social_reach": 10100000,
  "website": "https://www.rahulkapoor.in/",
  "_cache_schema_version": 2,
  "what_you_do": "Rahul Kapoor is a motivational speaker, transformation specialist, and mindset coach who helps individuals and organizations unlock their full potential.",
  "who_you_serve": "Rahul Kapoor serves individuals, teams, and organizations looking to transform their mindset, achieve their goals, and enhance their personal and professional lives.",
  "offering": "Rahul Kapoor offers a range of programs including motivational talks, transformation workshops, team building sessions, mindset coaching, and youth programs.",
  "social_proof": "Rahul Kapoor has over 25 years of experience, has transformed over 400,000 attendees, and has been featured in various media outlets such as The Week, Khaleej Times, The Times of India, The Hindu, and Deccan Herald.",
  "signature_programs": "The Unstoppable Mindset, Ignite Your Inner Potential, GO ALL IN, Level 10 Game, Transformation In Action, Vision & Values Project, Effective Decision Making, Work Life Happiness, One Team - One Dream, Game On Excellence, Personal Mindset Coaching, Family Mindset Coaching, Goal Setting, The Super Student",
  "booking_link": "https://www.rahulkapoor.in/contact-rahulkapoor.php",
  "niche": "motivational speaking, mindset coaching, transformation",
  "phone": "+91-7022010145",
  "company": "Rahul Kapoor",
  "tags": [
    "motivational speaker",
    "mindset coach",
    "transformation specialist"
  ],
  "audience_type": "individuals, teams, organizations",
  "business_focus": "Rahul Kapoor helps individuals and organizations transform their mindset and achieve their goals through a range of programs and coaching services.",
  "service_provided": "motivational talks, transformation workshops, team building sessions, mindset coaching, youth programs",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T03:22:51.843753"
}