{
  "name": "Janelle Anderson",
  "company": "Business Coaching, Coach Marketing Training, Communication Training, Course Creation Training, Event Hosting, Group Coaching, Online Course Creation, Presentation Skills, Public Speaking, Speaker Training, Startup Coaches",
  "list_size": 67329,
  "offering": "Emerging Life Coaching, LLC",
  "content_platforms": {
    "facebook": "https://www.facebook.com/Spunkyoldbroad1/posts/janelle-anderson-a-confidence-coach-for-women-entrepreneurs-and-leaders-talks-ab/1526058204240747/?locale=es_LA",
    "apple_podcast": "https://podcasts.apple.com/us/podcast/the-janelle-show/id1446365804",
    "youtube": "https://www.youtube.com/watch?v=BycVdZJSVas",
    "linkedin": "https://www.linkedin.com/pulse/client-generating-machine-coaches-janelle-holden"
  },
  "jv_history": [
    {
      "partner_name": "Level Up Your Course Podcast with Janelle Allen: Create Online Courses that Change Lives",
      "format": "podcast_guest",
      "source_quote": "Coach, and Entrepreneur\n\n- 4.8 (35)\n- BUSINESS Janelle Allen from the Zen Courses blog interviews successful online course creators, sharing their stories, successes, and struggles. On the podcast, sh",
      "source_url": "https://podcasts.apple.com/us/podcast/level-up-your-course-podcast-with-janelle-allen-create/id1045235303"
    },
    {
      "partner_name": "For Real: Life, Leadership, & Unlearning - Podcast - Apple Podcasts",
      "format": "summit_speaker",
      "source_quote": "high-achievers who look successful on paper but feel like they’re one group text away from burning it all down. Hosted by Megan Gillikin - serial entrepreneur, business coach, keynote speaker, and ...",
      "source_url": "https://podcasts.apple.com/ph/podcast/for-real-life-leadership-unlearning/id1364434224"
    },
    {
      "partner_name": "The Maturepreneur Podcast with Jannette Anderson",
      "format": "endorsement",
      "source_quote": "business owners, and those that are ... For over 40 years Jannette has taught entrepreneurs how to master the inner and outer game of business—a.k.a. how to ... looking for guests to interview? I'd lo",
      "source_url": "https://podcasts.apple.com/gb/podcast/the-maturepreneur-podcast-with-jannette-anderson/id1733501713"
    }
  ],
  "audience_engagement_score": 0.6000000000000001,
  "website": "https://www.janelanderson.com/training",
  "_cache_schema_version": 2,
  "what_you_do": "Dr. Janel Anderson creates fun, dynamic training sessions in communication, leadership, and collaboration for adult audiences, both online and in person.",
  "who_you_serve": "Organizations and teams seeking training in communication, leadership, team building, and virtual/hybrid work skills.",
  "social_proof": "Ph.D. (referred to as Dr. Anderson), over a dozen years developing training courses.",
  "signature_programs": "Mastering Difficult Conversations, Effective Workplace Communication, Communicating Strategically, Active Listening: Hear What You've Been Missing, Communicating with Difficult People, Better Communication Better Teams, Leading Thriving Virtual and Hybrid Teams, Leadership Communication Skills, Coaching Skills for Managers, Growing Your Power and Influence, Key Skills for Emerging Leaders, Leadership for Board Members, Growth Mindset: Maximize Your Potential, Navigating Change in a Whole New Way, The Art and Science of Self Coaching, Leading Effective Virtual and Hybrid Meetings, Team Building for Virtual and Hybrid Teams, Maximizing Performance while Leading Remotely, Thriving as a Hybrid or Virtual Team Member, Fewer Meetings Faster Momentum",
  "booking_link": "https://www.janelanderson.com/contact",
  "niche": "Leadership communication training",
  "phone": "612-327-8026",
  "tags": [
    "communication",
    "leadership",
    "team building",
    "virtual teams",
    "hybrid work",
    "difficult conversations",
    "coaching"
  ],
  "audience_type": "B2B",
  "business_focus": "Providing dynamic training programs in communication, leadership, and collaboration for organizations and teams.",
  "service_provided": "Communication training, leadership training, team building training, virtual and hybrid meeting training, custom training program development, consulting, speaking",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T00:31:44.280086"
}