{
  "name": "Christa Hess",
  "list_size": 0,
  "what_you_do": "Founder of Grit N Grow Kidz Academy, empowering children through entrepreneurship education, emotional regulation, and essential life skills.",
  "business_focus": "Empowering children through entrepreneurship education, emotional regulation, and life skills development.",
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/in/christahess",
    "youtube": "https://www.youtube.com/channel/UClRrqa3tQ1wckbgdtM81meA",
    "apple_podcast": "https://podcasts.apple.com/ca/podcast/christine-hassler-its-never-too-late-to-change-your-life/id1465291728?i=1000519985490"
  },
  "audience_engagement_score": 0.55,
  "website": "https://kidpreneurs.org/coach/christa-hess/",
  "linkedin": "https://www.linkedin.com/in/christahess",
  "_cache_schema_version": 2,
  "_phase2_enriched": true,
  "_phase2_date": "2026-02-18T07:01:30.259531",
  "who_you_serve": "Children ages 9-12 and their parents, helping young people develop entrepreneurial skills, confidence, and emotional resilience.",
  "offering": "Kidpreneur education, mentoring, and entrepreneur coaching for kids covering business fundamentals, problem-solving, emotional regulation, and financial literacy.",
  "niche": "Youth entrepreneurship education",
  "bio": "Christa Hess is the founder of Grit N Grow Kidz Academy, a certified Kidpreneur Educator based in Columbus, Ohio. With over 20 years of experience nurturing creativity and business acumen in children, she teaches business fundamentals, problem-solving, emotional regulation, and financial literacy to young leaders. As a mother of two, she is dedicated to helping children cultivate grit, overcome challenges, and unleash their potential.",
  "tags": [
    "youth entrepreneurship",
    "financial literacy",
    "emotional resilience",
    "kidpreneur education",
    "leadership development",
    "confidence building"
  ],
  "audience_type": "B2C",
  "service_provided": "Kidpreneur education, mentoring, entrepreneur coaching for kids, hybrid online and in-person coaching",
  "network_role": "Educator",
  "signature_programs": "Grit N Grow Kidz Academy"
}