{
  "name": "Carl Casanova",
  "list_size": 0,
  "seeking": "Carl is a general business consultant with a virtual assistant tag, suggesting he may offer virtual or remote consulting and admin support services. He likely seeks referral partners who work with small businesses or entrepreneurs and can funnel overflow clients needing admin, strategy, or operational support. A reciprocal referral arrangement with business coaches, online business managers, or productivity consultants would suit him well.",
  "who_you_serve": "Individuals seeking greater success professionally and personally, including those pursuing coach certifications, continuing education, and interpersonal development.",
  "what_you_do": "Founder and Director of New Vibe Coach Training, Oregon's first ICF Coach Certification Training School, offering ICF approved Coach Certifications, Business Development, and Life Skills trainings.",
  "business_focus": "Providing ICF approved coach certification training and professional development to equip individuals to advance their life purpose.",
  "audience_type": "Coaches/Consultants",
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/in/carl-casanova",
    "facebook": "https://www.facebook.com/carlos.casanovasbassas/"
  },
  "audience_engagement_score": 0.4,
  "website": "https://www.newvibetraining.com/about",
  "linkedin": "https://www.linkedin.com/in/carl-casanova",
  "_cache_schema_version": 2,
  "_phase2_enriched": true,
  "_phase2_date": "2026-02-18T07:01:43.419448",
  "offering": "ICF approved Coach Certifications, Business Development trainings, Life Skills trainings, Continuing Education Units (CEU), college credits, executive business coaching, keynote speaking, and workshop facilitation.",
  "niche": "Coach Training",
  "bio": "Carl Casanova, M.S., MCC, is the Founder and Director of New Vibe Coach Training, Oregon's first ICF Coach Certification Training School established in 2002. He is an ICF Master Certified Coach with over 25 years of experience in the human development sector, including work as a seminar leader, keynote speaker, mental health therapist, teacher, and executive business coach for several Fortune 500 companies. He graduated from Oregon State University with a Master of Science in Counseling Psychology and is the author of several books including co-authoring 'Blueprint for Success' with Dr. Ken Blanchard and the late Dr. Stephen Covey.",
  "tags": [
    "coach training",
    "icf certification",
    "executive coaching",
    "keynote speaker",
    "counseling psychology",
    "leadership development",
    "gallup strengths"
  ],
  "service_provided": "ICF Coach Certification Training, Executive Business Coaching, Keynote Speaking, Workshop Facilitation, Life Skills Training, Business Development Training, Continuing Education Units",
  "network_role": "Educator",
  "signature_programs": "New Vibe Coach Training Professional Coach Certification Program, 'What Every Successful Person Knows' (book), 'Help I Am Angry' (book), 'Blueprint for Success' (book, co-authored with Dr. Ken Blanchard and Dr. Stephen Covey)"
}