{
  "name": "Connie Kratky",
  "list_size": 0,
  "seeking": "Connie is a professional consulting provider who would seek JV partners with established audiences of entrepreneurs or business professionals who can refer clients needing consulting or strategic support. She is likely open to referral or co-promotional arrangements with complementary service providers. A cross-referral relationship with a coach, marketing consultant, or operations specialist targeting the same audience would be a practical match.",
  "what_you_do": "Sales coaching, training, and speaking specializing in overcoming Sales Call Reluctance, helping salespeople break through personal barriers and improve prospecting skills.",
  "business_focus": "Helping salespeople and sales teams overcome Sales Call Reluctance to prospect consistently, book more appointments, and close more sales.",
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/in/connie-kratky-4918299",
    "youtube": "https://www.youtube.com/watch?v=pZZO1tYqcwk",
    "apple_podcast": "https://podcasts.apple.com/us/podcast/e121-misty/id1685569424?i=1000693924075&l=zh-Hans-CN",
    "spotify_podcast": "https://open.spotify.com/artist/3lDW57vZZ9DhAxuwLLJ0uk"
  },
  "jv_history": [
    {
      "partner_name": "First Cruise to Alaska?  Avoid These 11 Mistakes in 2025!",
      "format": "affiliate",
      "source_quote": "au, and Skagway\\n22:43-24:05 Alaska ... Forget These!)\\n • ULTIMATE ALASKA Cruise Packing Guide (Don'... \\n\\nJuneau Walking tour map https://alaskafjordlines.com/maps/\\nSMART Bus in Skagway (907) 612-",
      "source_url": "https://www.youtube.com/watch?v=lnqq3ShaivM"
    }
  ],
  "audience_engagement_score": 0.55,
  "website": "https://www.exceptionalsales.com/about-us/",
  "_cache_schema_version": 2,
  "_phase2_enriched": true,
  "_phase2_date": "2026-02-18T07:02:01.415716",
  "who_you_serve": "Salespeople, financial advisors, executives, sales managers, and Fortune 50 corporations.",
  "niche": "Sales Call Reluctance",
  "bio": "Connie Kadansky, MCC, is a sales coach, trainer, and professional speaker specializing in overcoming Sales Call Reluctance with 28 years of experience. She has worked with Fortune 50 corporations, universities, multi-national organizations, and national non-profits including VMware, Bank of Montreal, New York Life, and Wintrust Commercial Finance. Her work has been featured in The Wall Street Journal, Forbes, CEO, Inc., Bloomberg Businessweek, and Investor's Business Daily.",
  "tags": [
    "sales coaching",
    "sales call reluctance",
    "prospecting",
    "sales training",
    "professional speaking",
    "neuroscience techniques",
    "sales negotiation"
  ],
  "audience_type": "Corporate",
  "service_provided": "Sales Call Reluctance coaching, SPQ Gold Assessment Test, Sales Call Reluctance Workshop, professional speaking, sales prospecting coaching, Master Sales Negotiation 8-week live class, Prospecting EKG assessments",
  "network_role": "Educator",
  "email": "connie@exceptionalsales.com",
  "phone": "602-380-5431",
  "signature_programs": "SPQ Gold Assessment Test, Sales Call Reluctance Workshop, Prospecting EKG, Master Sales Negotiation 8-week Live Class, Overcoming Sales Call Reluctance"
}