{
  "name": "Narcissistic Intelligence",
  "company": "More Info",
  "list_size": 0,
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/posts/talhorowitz_ai-models-are-narcissistic-by-design-and-activity-7374109943873830912-VcxX",
    "youtube": "https://www.youtube.com/watch?v=CYzFH4cgWjs"
  },
  "audience_engagement_score": 0.55,
  "website": "https://www.chelseybrookecole.com/speaker/",
  "_cache_schema_version": 2,
  "what_you_do": "Chelsey Brooke Cole is an internationally recognized speaker, psychotherapist, author, and coach who inspires, educates, and motivates audiences to identify, deal with, and effectively navigate narcissistic behaviors at home and in the workplace.",
  "who_you_serve": "Organizations and individuals dealing with narcissistic abuse and toxic workplace behaviors.",
  "offering": "Chelsey provides organizations with a roadmap to stop the spread of toxic workplace behaviors to improve engagement, productivity, and performance.",
  "social_proof": "Voted one of the Top 15 Coaches in Nashville by Influence Digest. Chelsey is also a Certified Partner Trauma Therapist, Registered Play Therapist, Level 1 Trained Gottman Method Couples Therapist, and board member of the Yow Foundation, Inc.",
  "signature_programs": "Chelsey is the author of \"If Only I'd Known! How to Outsmart Narcissists, Set Guilt-Free Boundaries, and Create Unshakeable Self-Worth\" set to be released August 15th.",
  "booking_link": "https://www.chelseybrookecole.com/contact",
  "niche": "narcissistic abuse",
  "tags": [
    "speaker",
    "psychotherapist",
    "author",
    "coach",
    "narcissistic abuse"
  ],
  "audience_type": "B2B, B2C",
  "business_focus": "Chelsey Brooke Cole is an internationally recognized expert in narcissistic abuse who provides speaking, training, and coaching services to help organizations and individuals deal with toxic workplace behaviors.",
  "service_provided": "Speaking, training, coaching",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T02:44:12.477154"
}