{
  "name": "Ridgely Goldsborough",
  "company": "Partner Attraction Formula",
  "list_size": 0,
  "offering": "Affiliate Marketing Software, Business Consulting, Content Creation, Content Marketing, Internet Marketing Expert, Joint Venture Resources, Marketing Expert, Online Course Creation",
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/company/compound-assistants",
    "apple_podcast": "https://podcasts.apple.com/no/podcast/discover-your-mind-type-ridgely-goldsborough/id1323200438?i=1000463696816",
    "youtube": "https://www.youtube.com/watch?t=1689&v=Kg0tVi5j2uM&feature=youtu.be"
  },
  "jv_history": [
    {
      "partner_name": "Creating & Influencing Emotional Attraction: Interview With ...",
      "format": "endorsement",
      "source_quote": "my asks Ridgely to share key tips from his signature Partner Attraction Formula and explain why he views authenticity as the ultimate currency in relationships. \\n\\nListen in to hear Ridgely ... \\n\\nT",
      "source_url": "https://www.youtube.com/watch?v=l-FGTREowW8"
    },
    {
      "partner_name": "122: The Money-Making Power of Personal Relationships with Colleen Goldenfarb",
      "format": "endorsement",
      "source_quote": "your partner to manage family logistics and strengthen your bond, something that is essential for any attorney seeking harmony. She recommends tools like John Gottman’s Eight Dates and personality ass",
      "source_url": "https://podcasts.apple.com/us/podcast/122-the-money-making-power-of-personal/id1636511715?i=1000698558475&l=zh-Hans-CN"
    }
  ],
  "audience_engagement_score": 0.55,
  "website": "https://mirasee.com/blog/podcasts/bringing-value-to-the-marketplace-ridgely-goldsborough/",
  "_cache_schema_version": 2,
  "what_you_do": "Ridgely Goldsborough is the founder of Mind Types and The Partner Attraction Formula, a cutting-edge program to attract ideal clients and partners using brain biology and limbic messaging.",
  "who_you_serve": "No information provided on the website about Ridgely Goldsborough's target audience.",
  "seeking": "No information provided on the website about partnerships or collaborations Ridgely Goldsborough is actively seeking.",
  "social_proof": "Ridgely Goldsborough is an entrepreneur, author, and international speaker. He has written 19 books, hosted his own television show, and created dozens of online programs on success and prosperity.",
  "signature_programs": "Mind Types and The Partner Attraction Formula",
  "booking_link": "No booking link provided on the website.",
  "niche": "brain biology, limbic messaging",
  "phone": "No phone number provided on the website.",
  "tags": [
    "brain biology",
    "limbic messaging",
    "entrepreneurship"
  ],
  "audience_type": "No information provided on the website about the type of audience Ridgely Goldsborough serves.",
  "business_focus": "Ridgely Goldsborough believes in solving problems and making sense out of complex topics.",
  "service_provided": "No specific services mentioned on the website.",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T02:38:21.368210"
}