{
  "name": "Lama Tantrapa",
  "company": "Academy of Qi Dao",
  "list_size": 80000,
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/in/tantrapa",
    "apple_podcast": "https://podcasts.apple.com/us/podcast/the-secrets-of-qigong-masters/id309482403",
    "youtube": "https://www.youtube.com/watch?v=eQL6N1Z2ALU"
  },
  "audience_engagement_score": 0.55,
  "website": "https://www.academyofqidao.com/",
  "linkedin": "https://www.linkedin.com/in/tantrapa",
  "_cache_schema_version": 2,
  "what_you_do": "Academy of Qi Dao is the first and only school in the world offering professional training in Qigong Coaching, combining ancient Energy Arts with modern coaching methodology.",
  "who_you_serve": "People experiencing chronic pain, stress, feeling stuck, or seeking spiritual self-realization, as well as practitioners aspiring to become certified Qigong coaches.",
  "social_proof": "First and only school in the world offering professional training in Qigong Coaching; described as the leading Qigong school of the 21st century.",
  "signature_programs": "Qigong Fundamentals, Abundance Through Being in the Flow, How to Overcome Qigong Problems, Basic Qi Dao Workshop, Basic Qi Dao Practitioner Certification Program, Qigong Coach Certification Program, From Chronic Pain to Wellness, From Stress to Being in the Flow, From Feeling Stuck to High Performance, From Spiritual Seeking to Self-Realization",
  "niche": "Qigong Coaching",
  "tags": [
    "qigong",
    "energy arts",
    "coaching",
    "certification",
    "wellness",
    "stress management",
    "spiritual development"
  ],
  "audience_type": "B2C",
  "business_focus": "Professional training and certification in Qigong Coaching, combining ancient Energy Arts with modern coaching methodology to help people overcome pain, stress, and personal challenges.",
  "service_provided": "Qigong coaching, online courses, certification programs, workshops, private coaching programs",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T00:30:37.636593"
}