{
  "name": "Andie Monet",
  "company": "Billionaire Women Rising",
  "list_size": 26100,
  "offering": "Business Coaching, Business Consulting, Content Creation, Lead Generation Specialists, Media Directories, Online Education for Business Owners, Podcast Host, Podcast Marketing, Social Media Marketing, Speaker Promotion",
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/in/andiemonet-ssd",
    "apple_podcast": "https://podcasts.apple.com/ca/podcast/and-she-rises/id1438759061"
  },
  "website": "https://www.zoominfo.com/p/Andie-Monet/3968456800",
  "linkedin": "https://www.linkedin.com/in/andiemonet-ssd",
  "_cache_schema_version": 2,
  "what_you_do": "Andie Monet is a business optimization expert and growth strategist who helps businesses achieve up to 300% growth in 1-4 months without increasing expenses.",
  "who_you_serve": "CEOs, visionary entrepreneurs, and mission-driven organizations, specifically women-led B2B companies generating 7-9 figures.",
  "social_proof": "Featured as a trusted advisor to major firms by age 20, Hollywood business consultant by 25, worked with domestic and foreign governments by 30; featured on ABC 15 and interviewed at the New York Stock Exchange with Jane King on New To The Street; speaker at RiseUp Summit.",
  "signature_programs": "Billionaire Women Rising (elite mentorship for women-led B2B companies); Multi-Dimensional (proprietary framework); Strategic Solutions & Development International, Inc. (SSD)",
  "niche": "Business optimization",
  "phone": "(346) 396-1214",
  "tags": [
    "business optimization",
    "women entrepreneurs",
    "growth strategy",
    "mentorship",
    "corporate training",
    "small business",
    "profit scaling"
  ],
  "audience_type": "B2B",
  "business_focus": "Helping entrepreneurs and business leaders double or triple profits by optimizing operations, systems, and processes without increasing costs.",
  "service_provided": "Business optimization consulting, corporate training, small and medium business training and courses, elite mentorship, keynote speaking",
  "email": "info@andiemonet.com",
  "_owl_enriched": true,
  "_owl_timestamp": "2026-02-18T04:08:40.003082"
}