{
  "name": "Diane Armitage",
  "company": "Armitage, Inc.",
  "list_size": 54163,
  "offering": "Book Editing and Layout, Business Consulting, Content Creation, Copywriting, Copywriting Training, E-Commerce Marketing, Funnel Creation Consulting, Internet Marketing Course, Internet Marketing Expert, Marketing Expert, Membership Platform, Website Design, Website Hosting",
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/in/dianearmitage",
    "youtube": "https://www.youtube.com/watch?v=DGRzM0lTkzY"
  },
  "audience_engagement_score": 0.55,
  "website": "https://dianearmitage.com/",
  "linkedin": "https://www.linkedin.com/in/dianearmitage",
  "_cache_schema_version": 2,
  "what_you_do": "Identity Architecture mentor and coach who teaches a philosophy that identity—not effort—determines success, helping people shift from a conditioned 'Matrix Identity' to their 'Original Identity'.",
  "who_you_serve": "Individuals seeking personal and professional transformation through identity-shifting principles.",
  "social_proof": "Worked side-by-side with Bob Proctor for 27 years writing and developing identity-shifting curriculum that has reached millions of people worldwide.",
  "signature_programs": "Identity Architecture, Built-In Tower of Power, Legendary ASK!, Legendary LEAP!, Legendary SPARK!, Joint Venture Genius, Money Physics, Catalyst Code Podcast, Golden Ticket Blog",
  "niche": "Identity transformation",
  "tags": [
    "identity architecture",
    "personal transformation",
    "mentorship",
    "mindset",
    "quantum leap success",
    "joint ventures",
    "coaching"
  ],
  "audience_type": "B2C, coaches, entrepreneurs",
  "business_focus": "Teaching a new economic philosophy and practice centered on identity transformation to create quantum-leap success.",
  "service_provided": "Personal mentoring (deep dive), one-on-one strategy calls, academy master classes, free webinars, podcast",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T00:32:06.901426"
}