{
  "name": "Mathen Thomas",
  "list_size": 0,
  "seeking": "Mathen Thomas is likely seeking JV partners who serve business professionals and entrepreneurs — such as business coaches, sales trainers, or startup advisors — who can refer clients for growth strategy and professional development engagements. He is explicitly described as seeking strategic partnerships and collaborative growth, suggesting interest in co-marketing, referral arrangements, or bundled service offerings with complementary business service providers. Partners who have established communities of growth-oriented SMB owners would be the most valuable collaborators for him.",
  "who_you_serve": "Business professionals and entrepreneurs seeking growth strategies and professional development solutions.",
  "audience_type": "B2B",
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/in/thomas-mathen-3a06564",
    "facebook": "https://www.facebook.com/thomasmathew999",
    "youtube": "https://www.youtube.com/c/WGRZTVNews"
  },
  "audience_engagement_score": 0.6000000000000001,
  "social_reach": 154000,
  "website": "https://mathewthomas.in/",
  "linkedin": "https://uk.linkedin.com/in/mathen-thomas",
  "_cache_schema_version": 2,
  "what_you_do": "Provides customized online and onsite soft skill training to suit business needs.",
  "social_proof": "18 years of CxO level trainings, helped 150+ clients develop a healthy leadership pipeline, rated \"Outstanding\" by 94% participants in all Soft Skills and Behavioural Trainings of 2024.",
  "signature_programs": "Emotional Intelligence Workshop, Storytelling Workshop, Leadership Communication Workshop",
  "niche": "corporate training",
  "company": "Mathew Thomas",
  "tags": [
    "leadership",
    "team building",
    "motivational speaking"
  ],
  "business_focus": "Provides corporate training solutions to help businesses transform their workplace with happy, engaged, effective, and productive employees.",
  "service_provided": "Leadership Development Program (LDP), Leadership Coach, Corporate Training, Stress Management – Mindfulness – Corporate Wellness Training, Team Building Trainings – Corporate Team Outings, Business Storytelling, Life Coach, Motivational Speaking",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T03:18:23.907804"
}