{
  "name": "Marty Dickinson",
  "company": "Here Next Year, LLC",
  "list_size": 7432,
  "offering": "Communication Training, Event Hosting, Networking Groups, Presentation Skills, Public Speaking, Speaker Organizations, Speaker Promotion, Speaker Training, Speaking Opportunities",
  "what_you_do": "Marty Dickinson, known as the Business Longevity Guy, works with business owners and leaders to attract sales opportunities and simplify the sales process.",
  "who_you_serve": "He serves business owners, leaders, and professionals looking to improve their marketing strategies and sales processes.",
  "niche": "business development",
  "signature_programs": "Lions Always Win: How to Spot What You Want in Your Professional Speaking Business and Life…and Get it Too, Lions Always Win: How to Spot What You Want in Business and Life…and Get it Too",
  "revenue_tier": "established",
  "service_provided": "workshops, speaking, coaching, training, consulting",
  "current_projects": "Speakers Speak Group on Facebook, Speakers Speak LIVE sessions, Speakers Speak PRO program",
  "business_size": "small_team",
  "tags": [
    "business longevity",
    "marketing",
    "sales",
    "speaking",
    "coaching",
    "workshops"
  ],
  "bio": "#1 Amazon Best Seller in three categories for Lions Always Win, founder of Speakers Speak LIVE, extensive speaking experience.",
  "business_focus": "Marty Dickinson, known as the Business Longevity Guy, works with business owners and leaders to attract sales opportunities and simplify the sales process. (business development)",
  "audience_type": "B2B",
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/in/martydickinson",
    "facebook": "https://www.facebook.com/groups/2815042615255352/posts/6732977976795110/",
    "instagram": "https://www.instagram.com/reel/DTGAhRCAJxZ/",
    "youtube": "https://www.youtube.com/watch?v=5s-5zJzIJtY"
  },
  "audience_engagement_score": 0.65,
  "website": "https://herenextyear.com/marty-dickinson/",
  "linkedin": "https://www.linkedin.com/in/martydickinson",
  "_cache_schema_version": 2
}