{
  "name": "Paulette Ensign",
  "company": "Tips Products International",
  "list_size": 2000,
  "offering": "Business Consulting, Compilation Books, Content Creation, Content Marketing, Joint Venture Resources, Marketing Expert",
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/in/pauletteensign",
    "youtube": "https://www.youtube.com/watch?v=MRJP7_OXiXY"
  },
  "jv_history": [
    {
      "partner_name": "5 Tips and Innovative Promotional Product Ideas for Your Company Events",
      "format": "endorsement",
      "source_quote": "Events like New Years Eve, a Ship Christening, a Golf Tournament serve as a vital platform for businesses to promote ... promotional products marketing company is collaborating with clients. We  have ",
      "source_url": "https://www.linkedin.com/pulse/5-tips-innovative-promotional-product-ideas-your-company-grossman-n5gdc"
    },
    {
      "partner_name": "- YouTube",
      "format": "affiliate",
      "source_quote": "the main supplies used. Affiliate links may be used at ... https://jmink.me/2R7YBbr\\n\\n• Simon Says Stamp A2 Envelope Die\\n ——— https://ldli.co/e/zkem11 [ SimonSaysStamp ] \\n\\n• ... LinkDeli - https:/",
      "source_url": "https://www.youtube.com/watch?v=MRJP7_OXiXY"
    }
  ],
  "audience_engagement_score": 0.55,
  "website": "https://canvasrebel.com/meet-paulette-ensign/",
  "linkedin": "https://www.linkedin.com/in/pauletteensign",
  "_cache_schema_version": 2,
  "what_you_do": "Paulette Ensign is a professional organizing and productivity consultant who has written and sold over two million copies of a tips booklet called \"110 Ideas for Organizing Your Business Life\".",
  "who_you_serve": "Subject Matter Experts, Speakers, Consultants, Coaches, and others in the information publishing industry.",
  "seeking": "The website does not explicitly state what partnerships or collaborations Paulette Ensign is actively looking for.",
  "social_proof": "Paulette Ensign has personally sold over two million copies of her tips booklet in several languages and formats without any advertising.",
  "signature_programs": "\"110 Ideas for Organizing Your Business Life\" tips booklet",
  "niche": "information publishing",
  "tags": [
    "tips booklets",
    "information publishing",
    "productivity consulting"
  ],
  "audience_type": "B2B, Subject Matter Experts, Speakers, Consultants, Coaches",
  "business_focus": "Helping Subject Matter Experts monetize content they have overlooked and minimized in the form of how-to tips, and teaching a business sales model of one-to-many bulk sales and content licensing.",
  "service_provided": "tips booklets, content licensing, business sales model consulting",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T01:39:51.687486"
}