{
  "name": "RaShawn Renée",
  "list_size": 0,
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/in/rashawn-ren%C3%A9e-9a50b1200",
    "facebook": "https://www.facebook.com/p/ShawnaRenes-Creations-100086056429199/"
  },
  "audience_engagement_score": 0.4,
  "website": "https://realtruthintl.com/events/",
  "linkedin": "https://www.linkedin.com/in/rashawn-ren%C3%A9e-9a50b1200",
  "_cache_schema_version": 2,
  "what_you_do": "RaShawn-Renée leads speaking, teaching, and signing engagements to help individuals gain understanding of their Real Truth and Power and discover the possibility to them once they make the Self-Honoring Choice to live a Wholly-Fulfilling-Life.",
  "who_you_serve": "Individuals that are chosen by their Employer, University, Community or Organization to learn the profound knowledge of their Real Truth and how to live with Power.",
  "offering": "Tools, understanding, language, and next steps so that each participant can walk away having benefited from the engagement and next steps to live the life they truly desire.",
  "social_proof": "RaShawn-Renée had a full-circle moment and moments of gratitude for another recognition of the guidance from her Inner-Knowing of a seemingly chance encounter at a Revelation Conference more than a decade ago.",
  "signature_programs": "44 Hours & 21 Minutes; A Woman's Truth & Power",
  "niche": "personal development, self-empowerment",
  "company": "Real Truth International, LLC",
  "tags": [
    "personal development",
    "self-empowerment",
    "speaking engagements"
  ],
  "audience_type": "individuals, employees, students, community leaders, organizers",
  "business_focus": "Providing speaking, teaching, and signing engagements to help individuals gain understanding of their Real Truth and Power and discover the possibility to them once they make the Self-Honoring Choice to live a Wholly-Fulfilling-Life.",
  "service_provided": "speaking engagements, teaching, book signing",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T03:22:09.386319"
}