{
  "name": "Kristina Safarova",
  "company": "Communication T",
  "list_size": 100000,
  "offering": "StrategyTraining.com",
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/posts/kristinasabakova_ahoy-mates-its-my-last-day-aboard-the-activity-7288438638256771072-gIUh",
    "tiktok": "https://www.tiktok.com/@kristinaavdeeva1"
  },
  "audience_engagement_score": 0.4,
  "website": "https://firmsconsulting.com/kris-safarova-biography/",
  "_cache_schema_version": 2,
  "what_you_do": "Strategy consulting firm offering coaching, mentoring, and training programs for aspiring and current consultants and executives.",
  "who_you_serve": "Aspiring consultants, executives, and professionals seeking careers at top consulting firms or building their own consulting practices.",
  "social_proof": "Amazon best-seller (The Strategy Journal), ex-McKinsey partner network",
  "signature_programs": "Consulting Sales Rainmaker Program, The MasterPlan Acceleration Program, Executive Presence & Communication Coaching Program, The Authority Based Business Mentoring & Coaching Program, EB-1A Green Card: An Alien of Extraordinary Ability, Speak Without Limits, The Andrew Program, Published Author Program, Strategy Studies, Titans of Strategy, Innovating an Industrial Giant",
  "booking_link": "https://team-firmsconsulting.wistia.com/medias/cvawu3c08s",
  "niche": "Strategy consulting",
  "tags": [
    "strategy consulting",
    "case interviews",
    "career coaching",
    "executive presence",
    "consulting sales",
    "leadership",
    "published author"
  ],
  "audience_type": "B2B, aspiring consultants, executives",
  "business_focus": "Helping professionals break into top consulting firms and build successful consulting practices through coaching, training, and strategy content.",
  "service_provided": "Career coaching, case interview preparation, consulting sales training, executive presence coaching, published author program, strategy training videos, mentoring programs, EB-1A green card guidance",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T00:29:05.705202"
}