{
  "name": "Amy",
  "list_size": 0,
  "seeking": "Seeks JV partners who can refer professional clients needing consulting or advisory support. Limited profile data suggests general openness to cross-referral with professionals in complementary business services.",
  "what_you_do": "Burnout coach and speaker who helps people break free from burnout through clarity, direction, and positive habits.",
  "who_you_serve": "People experiencing burnout, including corporate teams and individuals seeking work-life balance.",
  "niche": "Burnout coaching",
  "signature_programs": "Beyond Burnout Framework, Life on MY Terms Podcast, My Journey To Happiness (eBook), Beyond Burnout Community",
  "revenue_tier": "emerging",
  "company": "Amy Mangueira",
  "service_provided": "1:1 burnout coaching, group burnout coaching, corporate workshops, speaking engagements, podcast, author",
  "business_size": "solo",
  "tags": [
    "burnout coaching",
    "self-care",
    "motivational speaking",
    "entrepreneurship",
    "wellness",
    "corporate workshops",
    "author"
  ],
  "social_proof": "4x Entrepreneur, Motivational Speaker, Author, Host of 'Life on MY Terms' Podcast",
  "bio": "Amy Mangueira is a 4x entrepreneur, burnout and self-care expert, coach, speaker, and author. She has 10+ years of experience in digital marketing and is a professor at Southern New Hampshire University. Her Beyond Burnout Framework has helped thousands transform their lives.",
  "business_focus": "Helping individuals and organizations break free from burnout through coaching, workshops, and speaking.",
  "audience_type": "B2C, Corporate",
  "content_platforms": {
    "apple_podcast": "https://podcasts.apple.com/us/podcast/life-on-my-terms/id1633698416",
    "linkedin": "https://www.linkedin.com/pulse/transforming-online-learning-evidence-based-practices-amy-mangueira-9cowe",
    "facebook": "https://www.facebook.com/public/Amy-Mangrum/"
  },
  "audience_engagement_score": 0.4,
  "website": "https://www.amymangueira.com/home",
  "_cache_schema_version": 2,
  "_phase2_enriched": true,
  "_phase2_date": "2026-02-18T07:00:11.010494",
  "offering": "Burnout coaching, interactive workshops, speaking engagements, and a proven burnout framework.",
  "network_role": "Educator",
  "email": "info@personalbestcoaching.net"
}