{
  "name": "Dianna Whitley",
  "company": "Get Results With Hypnosis",
  "list_size": 15004,
  "content_platforms": {
    "youtube": "https://www.youtube.com/watch?v=m-LOKyykTic",
    "apple_podcast": "https://podcasts.apple.com/nz/podcast/accelerated-hypnotherapy-rapid-results/id1514438922",
    "spotify_podcast": "https://open.spotify.com/track/3Ka74TTMjclHgHY9Xc7cfG"
  },
  "audience_engagement_score": 0.55,
  "website": "https://www.getresultswithhypnosis.com/",
  "_cache_schema_version": 2,
  "what_you_do": "Dianna Whitley is a certified hypnotherapist and coach who helps people break negative habits and establish positive ones through hypnosis delivered via Zoom or in-person sessions.",
  "who_you_serve": "Individuals and business people/entrepreneurs seeking to overcome personal challenges (weight loss, smoking, anxiety, sleep) or business obstacles (confidence, procrastination, limiting beliefs).",
  "social_proof": "25 years of experience as a certified hypnotherapist; has helped over 7,000 people with personal challenges; author of 'Staying Young at Any Age'; Ambassador with AZ Women Networking.",
  "signature_programs": "Staying Young at Any Age (book); stress reduction audio (free); programs for weight loss, stop smoking, anxiety/stress reduction, confidence, sleep",
  "niche": "hypnotherapy coaching",
  "phone": "714-331-6699",
  "tags": [
    "hypnotherapy",
    "mindset coaching",
    "weight loss",
    "stress reduction",
    "habit change",
    "confidence",
    "stop smoking"
  ],
  "audience_type": "B2C",
  "business_focus": "Helping individuals and entrepreneurs reprogram their subconscious mind through hypnosis to eliminate negative habits and achieve personal and professional goals.",
  "service_provided": "hypnotherapy sessions (via Zoom), weight loss programs, stop smoking programs, anxiety and stress reduction, sleep improvement, confidence building, procrastination coaching, limiting beliefs removal, self-hypnosis training",
  "email": "diannawhitley@gmail.com",
  "_owl_enriched": true,
  "_owl_timestamp": "2026-02-18T05:08:40.463521"
}