{
  "name": "Ed Hendricks",
  "company": "Lifestyle",
  "list_size": 0,
  "seeking": "Ed Hendricks of Lifestyle, providing lifestyle consulting and personal development services, likely seeks JV partners in the health, wellness, or personal growth space who serve clients looking to improve quality of life. Partners such as life coaches, wellness practitioners, or motivational speakers with established audiences ready for lifestyle transformation would be strong referral sources. Co-creating workshops, retreats, or joint programs in the lifestyle and personal development niche would be natural fits.",
  "what_you_do": "Provides lifestyle consulting and personal development services.",
  "offering": "Lifestyle consulting and personal development services",
  "business_focus": "Provides lifestyle consulting and personal development services.",
  "website": "https://www.wcspeakers.com/speaker/edward-d-hendricks/",
  "linkedin": "https://www.linkedin.com/in/edhendricks",
  "_cache_schema_version": 2,
  "who_you_serve": "corporations and start-up companies, associations and not-for-profit organizations, and schools and educational institutions",
  "signature_programs": "Herding Cats and Weighing Frogs: Dealing with change and diversity and learning to motivate the new work force, The Ten Commandments of Creative Leadership, Successful Business Networking, Living Life to the Full: The art and science of being fully human, Reengineering Yourself to Reclaim Your Life and Achieve Success, Interpersonal Skills Development, Improvizational Acting and Communications Skills, Leadership and Teamwork Skills Development, Vision, Mission, and Strategy Development",
  "booking_link": "https://www.wcspeakers.com/request-speaker/?speaker-name=Edward%20D.%20Hendricks",
  "niche": "leadership, business skills, life skills",
  "phone": "818-991-5400",
  "tags": [
    "business skills",
    "change",
    "leadership",
    "life skills",
    "marketing",
    "networking"
  ],
  "audience_type": "B2B, B2C, associations, non-profits, education",
  "service_provided": "speaking, training, consulting",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T03:34:03.164038"
}