{
  "name": "LindaJoy Benn",
  "company": "Linda Benn International",
  "list_size": 12597,
  "offering": "Mastermind Groups, Networking Groups, Online Course Creation, Podcast Host, Public Speaking, Speaking Opportunities, Spiritual Coaching",
  "content_platforms": {
    "instagram": "https://www.instagram.com/p/DRDf5BNE-7j/",
    "youtube": "https://www.youtube.com/watch?v=mbY0HN3ChEU",
    "linkedin": "https://www.linkedin.com/pulse/why-you-should-seek-joy-lynnette-bellin-mba",
    "apple_podcast": "https://podcasts.apple.com/se/podcast/the-roadmap-that-could-change-eds-forever-with-lara/id1500589216?i=1000742445143"
  },
  "audience_engagement_score": 0.6000000000000001,
  "website": "https://lindabenn.com/",
  "linkedin": "https://au.linkedin.com/in/lindabenn",
  "_cache_schema_version": 2,
  "what_you_do": "Linda Benn helps people restore balance, energy, and clarity when life has pushed their system into survival. Her work blends lived experience, deep training, and practical embodiment so change becomes something you feel, not just understand.",
  "who_you_serve": "People navigating stress, burnout, and emotional overload",
  "social_proof": "Linda is an international speaker, a MoJOY Specialist, and the creator of the BENN Method™, and her work has been shared on global stages, including Mega Success Events in Los Angeles, where she has interviewed Dr. Phil and collaborated with thought leaders and change-makers from around the world.",
  "signature_programs": "The BENN Method™, 5R Renewal Program, Burnout to Bliss and Beyond Course, The Intuition Activation Program, The Anger Alchemy Course",
  "niche": "holistic healing",
  "tags": [
    "holistic healing",
    "nervous system regulation",
    "embodied transformation"
  ],
  "audience_type": "B2C",
  "business_focus": "Providing holistic services, guided learning, and embodied practices to help people restore calm, clarity, and self-trust.",
  "service_provided": "Cranial Sacral Therapy, Harmonize Your Bioenergetic Field With Healy, Intuitive Bodywork Energy Healing and Coaching Session, Intuitive Guidance Oracle Tarot Card Reading, Ortho-Bionomy Bodywork, Pellowah Healing, Reiki and Psychic Healing, Umana Healing Technique, Corporate Wellness Program Provider",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T01:12:13.487879"
}