{
  "name": "Andrea Bullard",
  "list_size": 0,
  "seeking": "Seeks JV partners who can refer professional clients needing consulting or business development services. Limited profile data suggests openness to cross-referral arrangements with professionals in aligned service areas.",
  "what_you_do": "Business coaching and practice management for financial advisors and wealth management professionals, helping them build multi-million dollar practices.",
  "business_focus": "Coaching financial advisors and entrepreneurs to build high-profit wealth management practices with more time freedom.",
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/in/andrea-bullard-b2980a87",
    "facebook": "https://www.facebook.com/public/Andrea-Ballard"
  },
  "audience_engagement_score": 0.4,
  "website": "https://andreabullard.com/about/",
  "_cache_schema_version": 2,
  "_phase2_enriched": true,
  "_phase2_date": "2026-02-18T07:00:12.006662",
  "who_you_serve": "Financial advisors, wealth management professionals, CEOs, and results-driven entrepreneurs.",
  "niche": "Financial advisor coaching",
  "bio": "Andrea K. Bullard is a business coach and author specializing in helping financial advisors and wealth management professionals build thriving practices. She played Division I Volleyball at the University of Wisconsin-Madison and holds both a Bachelor's and Master of Science degree from UW-Madison. Her book Turn-Key Secrets is a #1 International Best Seller on Amazon.",
  "tags": [
    "business coaching",
    "financial advisors",
    "wealth management",
    "practice management",
    "leadership",
    "speaker",
    "author"
  ],
  "audience_type": "B2B",
  "service_provided": "Platinum Turn-Key Mastermind, Business Masters Academy, Private Coaching, VIP Day with Andrea, Speaking, Keynote Speaking",
  "network_role": "Educator",
  "email": "andrea@andreabullard.com",
  "phone": "(978) 443-5342",
  "signature_programs": "Platinum Turn-Key Mastermind, Business Masters Academy, Private Coaching, VIP Day with Andrea, Turn-Key Secrets: The Ultimate Guide to Building Your Multi-Million Dollar Wealth Management Practice, The Turn-Key Office System for Financial Reps"
}