{
  "name": "Rana Al-Falaki",
  "company": "AlFa Leadership & wellbeing",
  "list_size": 25880,
  "offering": "Business Coachi",
  "content_platforms": {
    "apple_podcast": "https://podcasts.apple.com/lv/podcast/467-dr-rana-al-falaki-health-performance/id1080281169?i=1000700238319",
    "linkedin": "https://www.linkedin.com/posts/rawan-althagafy_one-of-the-most-common-questions-i-get-is-activity-7371414915477073920-1hfB",
    "youtube": "https://www.youtube.com/watch?v=n9HNvIx2KA8",
    "instagram": "https://www.instagram.com/p/DL_1Xg3S8iR/"
  },
  "jv_history": [
    {
      "partner_name": "Career talks: Meet Enas Halaiqah, the Etiquette Trainer transforming workplace culture",
      "format": "endorsement",
      "source_quote": "as Halaiqah, the Etiquette Trainer transforming workplace culture] \n\nEnas Halaiqa ... Enas's journey is a testament to the power of purposeful leadership and continuous learning. As a member of the Mi",
      "source_url": "https://www.linkedin.com/pulse/career-talks-meet-enas-halaiqa-etiquette-trainer-culture-zaghmout-yjptf"
    }
  ],
  "audience_engagement_score": 0.6000000000000001,
  "website": "https://www.drranaalfalaki.com/",
  "linkedin": "https://uk.linkedin.com/in/dr-rana",
  "_cache_schema_version": 2,
  "what_you_do": "Executive and leadership coach, international speaker, and specialist periodontist who combines leadership with wellbeing to enable high performance without burnout using a science-backed approach.",
  "who_you_serve": "Professionals, teams, and organisations seeking optimal performance through combined leadership and wellbeing strategies.",
  "social_proof": "#1 international best-selling author, ICF accredited certified professional coach, energy leadership master practitioner, CEO Today Executive Coaching Award, SME Business Elite Award, Acquisitions International Global Excellence Award, Women Of Heart Global Leadership & Impact Award, Best Transformation Speaker Award, Outstanding Contribution to the Training Industry from Professional Speakers Academy, British Dental Industry Awards for Best New Product/Service and Website, named one of Dentistry's Top 50 in 2025, certified trainer in Wiley's DiSC and The Five Behaviours, over 3 decades in healthcare, presence spanning mainstream TV, radio, podcasts, and magazine covers, international speaker across 25+ countries.",
  "signature_programs": "NAIL-IT Leadership System, NAIL-IT Leadership Book (pre-order, releasing February 2026), NAIL-IT In Dentistry, NAIL-IT Podcast, BREATHE Dental Wellness platform, Light Changes Coaching, 2-Minute Burnout Risk Quiz",
  "niche": "Leadership & Wellbeing",
  "tags": [
    "leadership coaching",
    "wellbeing",
    "burnout prevention",
    "optimal performance",
    "executive coaching",
    "periodontology",
    "public speaking"
  ],
  "audience_type": "B2B, professionals, teams, organisations",
  "business_focus": "Enabling high performance without burnout through combined leadership and wellbeing coaching, speaking, and training.",
  "service_provided": "Executive and leadership coaching, keynote speaking, training, presentation mentoring, DiSC and Five Behaviours facilitation, specialist dental courses, wellbeing platform",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T00:39:16.581428"
}