{
  "name": "ROLAND BENSON",
  "company": "Mugsandpuddles.com",
  "list_size": 3620,
  "offering": "Design, Website Design, Website Hosting",
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/in/rolandbenson",
    "instagram": "https://www.instagram.com/p/BJN5D-YDsLm/",
    "youtube": "https://www.youtube.com/watch?v=22GpSLW-T4w",
    "spotify_podcast": "https://open.spotify.com/track/43wl3l3n80zcTvOyAA5yWl",
    "facebook": "https://www.facebook.com/CowboyCoffeeCompanyInc/posts/the-hiatus-is-over-we-have-blanton-mugs-back-in-stock-these-are-made-locally-by-/3637429219645383/"
  },
  "audience_engagement_score": 0.65,
  "website": "https://anthonyjwbenson.com/about/",
  "_cache_schema_version": 2,
  "what_you_do": "Anthony J.W. Benson has mastered the art of merging soul and business. As founder and Creative Director of injoi Creative and Deeper Well Publishing, Anthony serves as a creative business strategist, manager, coach, producer, publisher, and writer specializing in working with consciously awake authors, speakers, musicians and performers, entrepreneurs, and small and large businesses.",
  "who_you_serve": "Anthony has worked with many entertainment and personal development leaders over the past four decades.",
  "social_proof": "Anthony's professional background is a rich mosaic of positions, projects, accomplishments, and adventures. He has appeared, sharing his expertise, on The Wisdom Channel, Blog Talk Radio, Co-Creator Network, WCCO, and FOX TV, and has been featured as an authority in his field in Evolving Wellness, Essence Magazine, Black Enterprise Magazine, The Minneapolis Star and Tribune, Edge Life, Minnesota Law & Politics, glad.is, Evolving Beings, Inspire Me Today, The St. Paul Pioneer Press, and Elephant Journal.",
  "signature_programs": "Anthony is an impassioned speaker and a respected emerging teacher in the transformational field. He has shared his expertise and wisdom on podcasts, radio shows, and stages throughout the country and internationally.",
  "niche": "creative business strategy, publishing, entertainment",
  "tags": [
    "creative business strategist",
    "manager",
    "coach",
    "producer",
    "publisher",
    "writer"
  ],
  "audience_type": "authors, speakers, musicians, performers, entrepreneurs, businesses",
  "business_focus": "Anthony serves as a creative business strategist, manager, coach, producer, publisher, and writer specializing in working with consciously awake authors, speakers, musicians and performers, entrepreneurs, and small and large businesses.",
  "service_provided": "creative direction, management, product/project strategy, design, writing, publishing, marketing, communications, music/video production",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T01:30:55.418512"
}