{
  "name": "Ronald Mann",
  "company": "Love Factor Inventory, LLC",
  "list_size": 6700,
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/in/ronmannphd",
    "facebook": "https://www.facebook.com/ronald.mann1/",
    "youtube": "https://www.youtube.com/watch?v=LuBA96LIpiQ"
  },
  "jv_history": [
    {
      "partner_name": "The Guide to True Love",
      "format": "endorsement",
      "source_quote": ". ... Understanding your partner’s love language is an important part of any relationship. By recognizing and understanding ... As a non-profit ecosystem, The Love Manual is dedicated to enhancing and",
      "source_url": "https://www.linkedin.com/pulse/guide-true-love-the-love-manual"
    }
  ],
  "audience_engagement_score": 0.6000000000000001,
  "website": "https://www.lovefactorinventory.com/about/",
  "_cache_schema_version": 2,
  "what_you_do": "Dr. Mann has been helping people awaken their consciousness for over forty years.",
  "social_proof": "Dr. Mann has appeared on national television, numerous radio interview shows and had his own local radio program in Sacramento on station KWWN. He has lectured internationally on the relationship between psychology and spirituality.",
  "signature_programs": "Dr. Mann has written six books: Sacred Healing: Integrating Spirituality with Psychotherapy (LA Times Bestseller); The Yoga of Golf; Bouncing Back: How to Recover When Life Knocks You Down; The Making Of A Champion: Success is an Inconvenience; Learning to Win: Guide to Coach Junior and Collegiate Golfers; and Bouncing Back 2017 in Crisis!: How to Prepare for and Recover From Life's Greatest Threats. He has also developed and produced a variety of audio programs for meditation, self-healing, and stress reduction.",
  "niche": "spiritual development, psychology",
  "tags": [
    "spiritual development",
    "psychology",
    "meditation",
    "self-healing",
    "stress reduction"
  ],
  "audience_type": "general public",
  "business_focus": "Helping people awaken their consciousness through spiritual and psychological services.",
  "service_provided": "books, audio programs, lectures, counseling",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T01:22:28.090832"
}