{
  "name": "Nicholas Harvey",
  "company": "Business Skills",
  "list_size": 0,
  "offering": "Nicholas Harvey Consulting",
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/in/nicholasharveyconsulting"
  },
  "website": "https://nicholasharveyconsulting.com/",
  "linkedin": "https://www.linkedin.com/in/nicholasharveyconsulting",
  "_cache_schema_version": 2,
  "what_you_do": "Nicholas Harvey Consulting is a strategic advisement and management consulting practice devoted to building adaptive human-centered cultures in the age of AI.",
  "who_you_serve": "C-Suite Executives, Managers, and Leaders; Nonprofit Organizations, Boards, and Executives; Community Engagement Officers; Corporate Social Responsibility Organizations; Social Justice Advocates and Organizations; Public Managers; Leaders of Faith Communities",
  "social_proof": "Dr. Nicholas Harvey is the Principal and CEO of Nicholas Harvey Consulting, known as the Leadership and Culture Catalyst. He is a credentialed ICF coach and certified administrator of key intercultural assessments. He holds advanced degrees from Georgia Tech, Emory University, and United Theological Seminary.",
  "signature_programs": "NQCLUSIONETICS™, a framework for building equitable, inclusive workplaces, and the Cultural Competency in Coaching Framework",
  "booking_link": "https://nicholasharveyconsulting.com/book-a-chat/",
  "niche": "leadership development",
  "tags": [
    "leadership",
    "culture",
    "ai",
    "organizational development",
    "strategic advisement"
  ],
  "audience_type": "B2B",
  "business_focus": "Nicholas Harvey Consulting helps corporate leaders create high-performing, human-centered cultures that thrive in the age of AI.",
  "service_provided": "Strategic Advisement, Strategic Workforce Development, Strategic Leadership Development, Strategic Organizational Development, Strategic Cultural Development, Discovery & Research",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T02:36:25.148904"
}