{
  "name": "Jeff Villwock",
  "company": "Acquisitions Professor LLC",
  "list_size": 4372,
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/in/jeffvillwock",
    "youtube": "https://www.youtube.com/watch?v=JsV5j-hbecA",
    "apple_podcast": "https://podcasts.apple.com/us/podcast/insider-stories-of-business-acquisitions-with/id1567679870?i=1000678136635"
  },
  "audience_engagement_score": 0.55,
  "website": "https://www.thetop100magazine.com/jeff-villwock",
  "_cache_schema_version": 2,
  "what_you_do": "Jeff Villwock founded Acquisitions Professor LLC in Bradenton, FL, to coach entrepreneurs who want to own their own businesses. His company specializes in buy-side mergers and acquisitions (M&A) and guides clients through every step of the acquisition process.",
  "who_you_serve": "Aspiring entrepreneurs who want to acquire their first company.",
  "offering": "Jeff's comprehensive coaching program trains buyers in the art of business acquisition, including identifying the right business to buy, conducting due diligence, securing financing, and closing the transaction. He also provides ongoing weekly coaching and ad hoc support.",
  "social_proof": "Jeff has completed over $2.6 billion in transactions, served as a partner and director of research at Johnson Rice & Co., and led healthcare research at The Robinson Humphrey Co. He has also been a managing director at three investment banking firms, two of which he founded. He has been named a Wall Street Journal All-Star Analyst twice.",
  "niche": "business acquisitions",
  "tags": [
    "business acquisitions",
    "mergers and acquisitions",
    "entrepreneurship",
    "coaching"
  ],
  "audience_type": "aspiring entrepreneurs",
  "business_focus": "Jeff Villwock founded Acquisitions Professor LLC to coach entrepreneurs who want to own their own businesses through the process of acquiring a company.",
  "service_provided": "business acquisition coaching, mergers and acquisitions advisory",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T01:28:43.967650"
}