{
  "name": "Christina Tasiou",
  "company": "Tasiou Enterprise Inc.",
  "list_size": 26700,
  "offering": "Business Coaching, Business Consulting, Children and Family, Coach Promotion, Content Creation, Course Creation Training, Financial Coaches, Intuition Coaching, Podcast Services, Public Speaking, Webinar Training",
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/posts/christina-piocosta-lahue-56003010_rensselaer-commercial-properties-certified-activity-6936057144400125952-LFMo"
  },
  "website": "https://voyagela.com/interview/inspiring-conversations-with-christina-tasooji-of-the-antidote-womens-collective/",
  "_cache_schema_version": 2,
  "what_you_do": "Writer and women's leadership coach offering bespoke, high-touch, one-on-one coaching containers for ambitious, heart-led women to translate their innate feminine power into actionable results.",
  "who_you_serve": "Ambitious, heart-led women including founders, business professionals, and creatives who believe in a world where all women are empowered and honored.",
  "social_proof": "Certified Integrative Transformational Coach, licensed CPA, over a decade of executive experience including roles at Deloitte, Disney, and leading startups in Silicon Valley, advocacy work impacting global companies like Meta, Pinterest, Snap Inc., and Shopify.",
  "signature_programs": "The Antidote Women's Collective",
  "niche": "Women's leadership coaching",
  "tags": [
    "women's leadership",
    "coaching",
    "feminine empowerment",
    "menstrual cycle awareness",
    "personal growth",
    "women's community"
  ],
  "audience_type": "B2C, founders, business professionals, creatives",
  "business_focus": "Empowering ambitious women through one-on-one coaching and a members-only community that connects and develops conscious feminine leaders.",
  "service_provided": "One-on-one coaching, members-only community, leadership development, well-being resources, self-reflection tools, virtual and in-person events, menstrual cycle awareness advocacy in corporate spaces",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T00:38:38.351531"
}