{
  "name": "Chris Kelly",
  "company": "Monetize Present Knowledge",
  "list_size": 974,
  "seeking": "Course platform owners, membership site builders, and video marketing experts. Technology stack partnerships and co-created knowledge monetization training would serve established experts packaging expertise.",
  "who_you_serve": "Established experts and knowledge creators ready to monetize expertise through online courses and content platforms.",
  "what_you_do": "Provides comprehensive knowledge monetization platform including course creation software, funnel tools, and marketing training.",
  "offering": "Business Consulting, Coach Marketing Training, Communication Training, Content Creation, Content Marketing, Course Creation Software, Course Creation Training, E-Commerce Marketing, Email Marketing Training, Form Creation Tools, Funnel Creation Tools, Internet Marketing Course, Joint Venture Resources, Landing Page Tools, Marketing Coach, Online Course Creation, Online Publishing Platform, Opt-In Page Creation, Presentation Skills, Public Speaking, Video Marketing, Website Design, Website Hosting",
  "business_focus": "Provides comprehensive knowledge monetization platform including course creation software, funnel tools, and marketing training.",
  "audience_type": "Established experts and knowledge creators ready to monetize expertise through online courses and co",
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/in/monetizepresentknowledge",
    "youtube": "https://www.youtube.com/watch?v=yINo1XF0EMY",
    "apple_podcast": "https://podcasts.apple.com/gb/podcast/185-podcast-growth-hacks-that-actually-work-boost-revenue/id1534942246?i=1000664438432",
    "spotify_podcast": "https://open.spotify.com/episode/2m8tNzMZHx1LpZtC0i9eNh"
  },
  "jv_history": [
    {
      "partner_name": "185 | Podcast Growth Hacks That Actually Work (& Boost Revenue), with Chris Hutchins",
      "format": "podcast_guest",
      "source_quote": "Chris Hutchins, founder and host of All The Hacks, scaled his show into a 7-figure business using only ads and affiliate revenue — that’s right, no courses or coaching services involved. In this episo",
      "source_url": "https://podcasts.apple.com/gb/podcast/185-podcast-growth-hacks-that-actually-work-boost-revenue/id1534942246?i=1000664438432"
    }
  ],
  "audience_engagement_score": 0.55,
  "website": "https://www.thriftbooks.com/w/monetize-present-knowledge--how-to-create-an-online-course-to-sell-what-you-know/11451370/",
  "_cache_schema_version": 2
}