{
  "name": "Ken Tucker",
  "company": "Changescape Web",
  "list_size": 1000,
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/in/kentuckerweb",
    "facebook": "https://www.facebook.com/photo.php?fbid=1272834721508401&id=100063456553781&set=a.133198508805367",
    "youtube": "https://www.youtube.com/watch?v=uRnEhI3wfFg"
  },
  "audience_engagement_score": 0.6000000000000001,
  "website": "https://changescapeweb.com/ken-tucker/",
  "_cache_schema_version": 2,
  "what_you_do": "Ken Tucker is the founder and Marketing Solution Architect of Changescape Web, a Small Business Digital Marketing and Website Design Agency specializing in developing comprehensive omni-channel marketing strategies and campaigns.",
  "who_you_serve": "small and mid-sized businesses across the US",
  "social_proof": "StoryBrand Certified Guide, Business Made Simple Certified Coach, Master Duct Tape Marketing Certified Consultant, Duct Tape Marketing Professional Services Marketing Expert Certified Consultant, Inbound Marketing Certified Professional (since 2010), SEO for Growth Consultant, Direct-Response Copywriting Specialist, and Customer Value Optimization Specialist Certified Consultant. Author of several books.",
  "signature_programs": "Social Media Marketing for Restaurants, Reputation Management: Proven Strategies & Tips for Improving Your Online Reputation, Content Marketing for Local Search",
  "booking_link": "https://changescapeweb.com/schedule-consultation/",
  "niche": "digital marketing",
  "phone": "636-337-3102",
  "tags": [
    "marketing strategy",
    "search engine optimization",
    "website design",
    "reputation management",
    "social media marketing",
    "lead generation",
    "marketing automation"
  ],
  "audience_type": "B2B",
  "business_focus": "Developing comprehensive omni-channel marketing strategies and campaigns for small and mid-sized businesses.",
  "service_provided": "marketing strategy, search engine optimization, website design, reputation management, social media marketing, lead generation, marketing automation",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T01:47:47.966983"
}