{
  "name": "PeggyLee Hanson",
  "company": "Personal Transition Guidance",
  "list_size": 101250,
  "offering": "Audio Books, Book Cover Design, Book Editing and Layout, Book Publishing, Book Publishing Classes, Book Writing Coach, Compilation Books",
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/in/peggyleehanson",
    "youtube": "https://www.youtube.com/watch?v=1kdNQEvM7UY",
    "facebook": "https://www.facebook.com/PeggyLeeHanson/",
    "apple_podcast": "https://podcasts.apple.com/lt/podcast/we-are-the-hansons-family-life-practical-tips-self-care/id1782861195"
  },
  "audience_engagement_score": 0.6000000000000001,
  "website": "https://courageouswomenpublications.com/about/",
  "_cache_schema_version": 2,
  "what_you_do": "International and best-selling author who is a leading authority on writing and getting published, helping first-time authors organize their thoughts into published works.",
  "who_you_serve": "First-time authors and aspiring writers who need help organizing their ideas and getting published.",
  "social_proof": "International and best-selling author, award-winning speaker, world-renowned mentor, certified instructional designer, certified business ghostwriter, certified Dream Coach® (supported by International Coach Federation), former Toastmasters International Central Division Governor, seventeen books published in less than four years, studied under Dr. Wayne Dyer, Dr. Deepak Chopra, John C. Maxwell, and others.",
  "signature_programs": "Courageous Women Publications anthology series, writing courses and retreats, Dream Coach® certification",
  "niche": "Author coaching",
  "tags": [
    "writing",
    "publishing",
    "author coaching",
    "ghostwriting",
    "instructional design",
    "dream coaching",
    "public speaking"
  ],
  "audience_type": "Aspiring authors, first-time writers",
  "business_focus": "Helping aspiring and first-time authors organize their ideas and get published through coaching, courses, retreats, and ghostwriting services.",
  "service_provided": "Writing courses, writing retreats, author coaching, business ghostwriting, instructional design, Dream Coaching",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T00:29:01.955397"
}