{
  "name": "Renae",
  "list_size": 0,
  "seeking": "Seeks JV partners who can refer business clients seeking professional expertise or measurable results in their engagements. Limited profile data suggests openness to cross-referral arrangements with professionals in aligned business service areas.",
  "content_platforms": {
    "facebook": "https://www.facebook.com/RenaeMusicOfficial/",
    "apple_podcast": "https://podcasts.apple.com/se/podcast/the-renae-saager-show/id1506966500"
  },
  "audience_engagement_score": 0.4,
  "website": "https://www.allthingsjrenee.com/pages/speaking",
  "linkedin": "https://au.linkedin.com/in/renae-richardson",
  "_cache_schema_version": 2,
  "what_you_do": "J.Renee is an entrepreneur, author, coach, speaker, and faith-driven strategist who empowers women of faith to shatter glass ceilings, break through limitations, and maximize their potential in both life and business using strategy, confidence, and fearless faith.",
  "who_you_serve": "J.Renee serves a wide range of organizations and events, including corporations, women's leadership programs, employee resource groups, professional development events, faith and marketplace initiatives, colleges and universities, student leadership, women's empowerment, campus faith communities, Greek-letter organizations, faith and women's conferences, women's ministries, church conferences, marketplace ministry gatherings, entrepreneurial events, business summits, retreats, masterminds, and e-commerce and startup trainings.",
  "social_proof": "J.Renee has spoken on stages across the country and internationally, including Vanderbilt University, University of Alabama, Fisk University, Tennessee State University, Austin Peay State University, The University of Tennessee at Chattanooga, Northern Virginia Community College — Loudoun, Tennessee Rehabilitation Center, Mielle Organics, Refresh Retreat — Cancun, Mexico, 2025 So Ambitious HBCU Accelerator, Delta Sigma Theta Sorority, Inc., and Alpha Kappa Alpha Sorority, Inc.",
  "booking_link": "https://www.allthingsjrenee.com/pages/booking",
  "niche": "faith-driven entrepreneurship",
  "company": "All Things J.Renee",
  "tags": [
    "entrepreneur",
    "author",
    "coach",
    "speaker",
    "faith-driven strategist"
  ],
  "audience_type": "B2B, B2C, faith-based, entrepreneurial",
  "business_focus": "Empowering women of faith to shatter glass ceilings, break through limitations, and maximize their potential in both life and business.",
  "service_provided": "speaking, coaching, strategy",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T03:21:30.445177"
}