{
  "name": "Tim",
  "list_size": 0,
  "seeking": "Tim, identified only as a business professional with no niche detail, likely seeks JV partners who can refer clients or provide complementary services within general business consulting or professional services. The absence of specifics suggests openness to a range of collaborative structures including referral agreements or co-promotion with established service providers. More data would be needed to target the right partnership type precisely.",
  "content_platforms": {
    "youtube": "https://www.youtube.com/c/WalkWithMeTim",
    "spotify_podcast": "https://open.spotify.com/album/6Ad1E9vl75ZB3Ir87zwXIJ"
  },
  "audience_engagement_score": 0.55,
  "social_reach": 25000,
  "website": "https://www.timstorey.com/",
  "_cache_schema_version": 2,
  "what_you_do": "Tim Storey is an acclaimed culture influencing thought-leader, life strategist, author, speaker and counselor.",
  "who_you_serve": "Tim Storey connects on a personal level with people of all walks of life, from entertainment executives, celebrities, business moguls, and professional athletes to adults and children in neighborhoods throughout America and in the most deprived and war-torn regions of the world.",
  "social_proof": "Tim Storey has been labeled as the Original Comeback Coach. He has worked with high-profile individuals such as Robert Downey, Jr., Charlie Sheen, Grant Cardone, Lewis Howes, Vidal Sassoon, Kanye West, and Christina Hall.",
  "signature_programs": "The Miracle Mentality, Comeback & Beyond, Utmost Living",
  "booking_link": "https://www.timstorey.com/booking",
  "niche": "life coaching, personal development",
  "company": "Tim Storey",
  "tags": [
    "life coach",
    "personal development",
    "author",
    "speaker"
  ],
  "audience_type": "B2B, B2C",
  "business_focus": "Tim Storey provides coaching, speaking, and counseling services to help people in personal recovery and discovery.",
  "service_provided": "coaching, speaking, counseling",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T03:25:36.429375"
}