{
  "name": "Ron Marshall",
  "list_size": 0,
  "seeking": "Seeks JV partners who can refer professional clients needing specialized expertise. Limited profile data suggests openness to cross-referral arrangements with aligned professionals in business service areas.",
  "content_platforms": {
    "facebook": "https://www.facebook.com/p/Ronald-R-Marshall-DDS-100054171745805/",
    "linkedin": "https://www.linkedin.com/posts/ronald-marshall-481398225_my-oldest-son-was-killed-in-california-on-activity-7267197505509957633-N3Vt",
    "youtube": "https://www.youtube.com/watch?v=gF0cM9dAkkk"
  },
  "audience_engagement_score": 0.6000000000000001,
  "website": "https://dcstw24.sched.com/speaker/nomatterwhatdream",
  "linkedin": "https://www.linkedin.com/in/ronmarshall",
  "_cache_schema_version": 2,
  "what_you_do": "Ron Mitchell is an American businessman, U.S. Army veteran, philanthropist, entrepreneur, lecturer, artist, author, and a champion for diversity and inclusion.",
  "who_you_serve": "He serves not-for-profit, local, state, and federal government agencies, institutions, and Fortune 500 companies.",
  "social_proof": "In 2012, Mitchell was recognized as one of the TOP 100 Minority and Women Entrepreneurs in America for business acumen and innovative approach to problem-solving and driving sustainable results. He has been featured on CNN, ABC, NBC, FOX, and Yahoo News.",
  "signature_programs": "Mitchell wrote the 'No Matter What You've Got To Live Your Dreams' book and workbook (published in 2014, 2015), album, and audible book in 2020. In 2023, he launched Mindful Extractions and BEM Capital.",
  "niche": "management consulting, diversity and inclusion, renewable energy, transportation electrification, energy efficiency, data and analytics",
  "company": "BEM Enterprises LLC, dba Team Ignite",
  "tags": [
    "management consulting",
    "diversity and inclusion",
    "renewable energy",
    "transportation electrification",
    "energy efficiency",
    "data and analytics"
  ],
  "audience_type": "not-for-profit, government, Fortune 500",
  "business_focus": "Provides solutions for not-for-profit, local, state, and federal government agencies, institutions, and Fortune 500 companies.",
  "service_provided": "people transformation, organizational strategy, diversity, equity and inclusion, renewable energy, transportation electrification, energy efficiency, data, and analytics",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T03:22:07.638428"
}