{
  "name": "Howard Rankin",
  "company": "Book Publishing",
  "list_size": 51200,
  "offering": ", Book Publishing Classes, Book Writing Coach, Business Consulting, Copywriting, Ghost Writers, Online Course Creation, Podcast Host, Speaker Training",
  "what_you_do": "Howard Rankin is a renowned addictions, relationship, and personal coach who helps individuals transform their lives by overcoming addiction and trauma through various coaching methods and courses.",
  "who_you_serve": "Howard serves individuals seeking to overcome addiction, trauma, and improve their personal relationships, including thought leaders and celebrities.",
  "niche": "addiction coaching",
  "signature_programs": "Courses on Weight Loss Leads to Weight Gain, Overcoming Guilt and Shame, The Miracle Within You, How to Really Change a Habit, Addiction Recovery, Communication, The Seven Pillars of Support",
  "revenue_tier": "premium",
  "service_provided": "1:1 coaching, group programs, courses, speaking, consulting",
  "current_projects": "Creating courses on various topics related to addiction and personal development.",
  "business_size": "small_team",
  "tags": [
    "addiction",
    "coaching",
    "personal development",
    "psychology",
    "communication",
    "behavior change",
    "media"
  ],
  "bio": "Best-selling author of over fifty self-help books, featured in major media outlets including BBC, CNN, and Wall St. Journal, with a radio show that has 1.5 million listeners in 30 countries.",
  "business_focus": "Howard Rankin is a renowned addictions, relationship, and personal coach who helps individuals transform their lives by overcoming addiction and trauma through various coaching methods and courses. (addiction coaching)",
  "audience_type": "B2C",
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/in/drhrankinthecommunicator",
    "apple_podcast": "https://podcasts.apple.com/us/podcast/the-addictions-of-our-lives-with-dr-howard-j-rankin-phd/id1474018356?i=1000600000775"
  },
  "website": "https://www.drhowardjrankin.com/coaching/",
  "linkedin": "https://www.linkedin.com/in/drhrankinthecommunicator",
  "_cache_schema_version": 2
}