{
  "name": "clare",
  "list_size": 0,
  "what_you_do": "Executive coaching, coaching supervision, and delivery of ILM coaching and supervision qualifications at levels 3, 5 and 7.",
  "offering": "Specializes in clare solutions. Helps clients achieve their business and personal goals.",
  "business_focus": "Providing executive coaching, coaching supervision, and ILM coaching qualifications for coaches and leaders.",
  "content_platforms": {
    "facebook": "https://www.facebook.com/clarepaint/",
    "youtube": "https://www.youtube.com/user/claresiobhan",
    "tiktok": "https://www.tiktok.com/@clarabellecwb"
  },
  "audience_engagement_score": 0.65,
  "social_reach": 460700,
  "website": "https://clarethecoach.com/about-clare/",
  "_cache_schema_version": 2,
  "_phase2_enriched": true,
  "_phase2_date": "2026-02-18T06:58:42.227840",
  "who_you_serve": "Managers, leaders, and experienced coaches seeking development, supervision, and coaching qualifications.",
  "niche": "Executive Coaching",
  "bio": "Clare Smale is an EMCC Accredited Master Coach and Accredited Supervisor based in Wiltshire, UK, awarded Global Coach of the Year 2023 by the EMCC. She began her coaching career in 2008 after a successful teaching career and established her own business with her husband in 2002. She has published three coaching books including her own leadership and coaching model, VISION, and works with clients across the world.",
  "tags": [
    "executive coaching",
    "coaching supervision",
    "leadership development",
    "ilm qualifications",
    "nlp",
    "cpd",
    "coaching education"
  ],
  "audience_type": "Coaches/Consultants",
  "service_provided": "Executive coaching, coaching supervision, ILM coaching qualifications (levels 3, 5, 7), CPD packages, coaching cards, leadership development",
  "network_role": "Educator",
  "email": "hello@clarethecoach.com",
  "phone": "+44 (0) 7977 362787",
  "signature_programs": "VISION leadership and coaching model, ILM Coaching and Supervision Qualifications (levels 3, 5, 7), CPD Packages, Coaching Cards, Teaching Expertise magazine (sold to Electric Word PLC)"
}