{
  "name": "Brady Patterson",
  "list_size": 5000,
  "offering": "Business Consulting, Content Creation, Course Creation Training, Email List Building, Email Marketing Training, Funnel Creation Consulting, Funnel Creation Tools, Joint Venture Resources, Lead Generation Specialists, Membership Platform, Online Course Creation, Online Education for Business Owners, Public Speaking, TeleSummits",
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/in/brady-patterson-design",
    "youtube": "https://www.youtube.com/@patterbt",
    "facebook": "https://www.facebook.com/login/?next=https%3A%2F%2Fwww.facebook.com%2FBrinleyPattersonsSupportPage%2F"
  },
  "audience_engagement_score": 0.6000000000000001,
  "website": "https://speakerhub.com/speaker/brady-patterson",
  "linkedin": "https://www.linkedin.com/in/thebradypatterson",
  "_cache_schema_version": 2,
  "what_you_do": "Brady Patterson is the Founder of the Outdoor Adventure School, an Information Marketing Training Center servicing the outdoor expert community, speaking on Course Creation, Joint Ventures, Business Strategy, and Partner Marketing Strategies.",
  "who_you_serve": "Experts and business owners in the outdoor community who want to create online courses and build promotional partnerships.",
  "seeking": "Multi-win promotional partnerships and joint ventures for business growth.",
  "social_proof": "Multiple best-selling author; COO of Success Road Academy (one of the largest information marketing training centers); original organizer of Entrepreneurs International Network (29+ chapters in 6 countries, 150,000+ members); worked with Fortune 500 companies Shell, BP, Husky Oil, and Suncor.",
  "signature_programs": "How to Create and Sell Online Courses in 60 Days or Less; Outdoor Adventure School",
  "niche": "Joint ventures",
  "company": "FunnelCures Inc",
  "tags": [
    "joint ventures",
    "course creation",
    "partner marketing",
    "affiliate marketing",
    "business strategy",
    "outdoor education",
    "information marketing"
  ],
  "audience_type": "B2B, coaches, experts, entrepreneurs",
  "business_focus": "Helping outdoor and business experts create online courses and build profitable joint venture partnerships.",
  "service_provided": "Speaking, course creation training, joint venture consulting, partner marketing strategy, affiliate recruitment",
  "_owl_enriched": true,
  "_owl_timestamp": "2026-02-18T04:14:21.809324"
}