{
  "name": "Melodie Tucker",
  "list_size": 0,
  "seeking": "Melodie serves professionals and individuals seeking coaching and personal development, suggesting she seeks JV partners who have audiences in corporate, entrepreneurship, or personal growth spaces to whom she can be introduced as a coach or consultant. She would likely be open to co-hosting events, webinars, or referral arrangements with complementary service providers. A reciprocal referral partnership with therapists, career counselors, or business coaches would align well.",
  "who_you_serve": "Professionals and individuals seeking coaching, consulting, and personal development guidance.",
  "audience_type": "B2C",
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/in/melodie-tucker-b615aaa",
    "facebook": "https://www.facebook.com/login/?next=https%3A%2F%2Fwww.facebook.com%2Fmelanie.tucker.522%2F",
    "apple_podcast": "https://podcasts.apple.com/us/podcast/rare-rebels/id1825523104?l=zh-Hans-CN",
    "youtube": "https://www.youtube.com/watch?v=qDrfH5QI4xY"
  },
  "audience_engagement_score": 0.6000000000000001,
  "website": "https://www.yourtango.com/experts/melodietucker",
  "linkedin": "https://www.linkedin.com/in/melodie-tucker-b615aaa",
  "_cache_schema_version": 2,
  "what_you_do": "Melodie Tucker is an internationally known Mars Venus Success Coach and instructor, guiding people to discover what it is they really want out of life--relationships, family, business/career--then helping them figure out how to get it.",
  "social_proof": "She is also a Prepare-Enrich couples mentor, an NLP practitioner, a workshop leader, public speaker, writer, and a contributing author to \"Vibrant Women's Wisdom\".",
  "niche": "relationships, family, business/career",
  "tags": [
    "relationship coach",
    "business coach",
    "career coach",
    "life coach",
    "personal development"
  ],
  "business_focus": "Melodie Tucker is a coach and instructor who helps people discover and achieve what they want in life.",
  "service_provided": "Relationship coaching, business coaching, career coaching, life coaching, personal development",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T03:18:18.636080"
}