{
  "name": "Jennifer McLean",
  "list_size": 530000,
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/in/jennifermclean1",
    "facebook": "https://www.facebook.com/jennifer.mclean1/",
    "apple_podcast": "https://podcasts.apple.com/us/podcast/from-pain-to-power-jennifer-mcleans-guide-to-emotional/id1690203019?i=1000663782203"
  },
  "audience_engagement_score": 0.4,
  "website": "https://theshiftnetwork.com/faculty/9120",
  "linkedin": "https://www.linkedin.com/in/jennifermclean1",
  "_cache_schema_version": 2,
  "what_you_do": "Internationally acclaimed healer, author, speaker, and transformational change agent who created the Spontaneous Transformation Technique (STT), a healing system that delivers instant transformation and healing in 7-10 minutes.",
  "who_you_serve": "Individuals seeking healing from old hurts and patterns, and entrepreneurs looking to make a difference through doing business-from-the-heart.",
  "social_proof": "Appeared on FOX, ABC, and CBS; featured in numerous online summits and publications; over 800 practitioners in training; Healing With The Masters online media franchise reached almost 1,000,000 people over 17 seasons; author of five books; endorsed by Marci Shimoff (NYT bestselling author) and Anita Moorjani (NYT bestselling author).",
  "signature_programs": "Spontaneous Transformation Technique (STT), Healing With The Masters, Spontaneous Transformation (course via The Shift Network)",
  "niche": "Healing and transformation",
  "tags": [
    "healer",
    "transformation",
    "spontaneous transformation technique",
    "author",
    "speaker",
    "energy healing",
    "coaching"
  ],
  "audience_type": "B2C, entrepreneurs",
  "business_focus": "Creator of the Spontaneous Transformation Technique healing system and healing-into-success coach supporting entrepreneurs to do business-from-the-heart.",
  "service_provided": "Healing sessions, practitioner training, online healing programs, coaching for entrepreneurs, speaking",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T00:23:45.900559"
}