{
  "name": "Nancy Bentley",
  "list_size": 0,
  "seeking": "Seeks JV partners who can refer professional clients needing consulting or business support. Limited profile data suggests openness to cross-referral arrangements with aligned coaches or consultants.",
  "content_platforms": {
    "youtube": "https://www.youtube.com/watch?v=B_CnzsSeJyU",
    "facebook": "https://www.facebook.com/public/Nancy-Bentley/",
    "instagram": "https://www.instagram.com/p/CoaZDnJuYih/"
  },
  "jv_history": [
    {
      "partner_name": "- YouTube",
      "format": "endorsement",
      "source_quote": "Amy Bentley is a historian with interests in the social, historical, and cultural contexts of food, she is the author of Inventing Baby Food: Taste, Health and the Industrialization of the American Di",
      "source_url": "https://www.youtube.com/watch?v=qmjWcIhB5UA"
    }
  ],
  "audience_engagement_score": 0.65,
  "website": "https://nancyleebentley.com/",
  "_cache_schema_version": 2,
  "what_you_do": "Nancy Lee Bentley is a Wholistic Nourishment Expert, Speaker, and Best-Selling Author.",
  "who_you_serve": "Conscious women leaders and changemakers, people on a health journey, communities ready to move from 'Me to We'.",
  "offering": "Nancy serves as a vision carrier and wayshower, offering Connective Talks, Cultivating Classes, and Community Circles.",
  "social_proof": "Nancy is a best-selling author and has a lifetime of experience in the organic movement and building food co-ops and community networks.",
  "signature_programs": "Nancy's signature program is The Food Circle, a visionary metasystem and blueprint for reconnecting people around food, nourishment, and shared purpose.",
  "niche": "wholistic nourishment",
  "company": "Nancy Lee Bentley",
  "tags": [
    "wholistic nourishment",
    "speaker",
    "author",
    "community building"
  ],
  "audience_type": "B2C, conscious leaders",
  "business_focus": "Nancy's work is about remembering who we are, what truly sustains life, and how food, community, and consciousness are inseparable.",
  "service_provided": "Connective Talks, Cultivating Classes, Community Circles",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T03:30:38.914226"
}