{
  "name": "Darren Douglas",
  "company": "Affinity Brand Marketing",
  "list_size": 543,
  "seeking": "Course creators and coaches needing comprehensive marketing support from strategy through execution. Perfect for white-label partnerships with service providers wanting turnkey marketing solutions for their clients.",
  "who_you_serve": "Coaches, consultants, and service providers who need comprehensive done-for-you marketing across branding, ads, content, and sales training.",
  "what_you_do": "Provides comprehensive marketing services including branding, copywriting, and digital advertising. Offers sales training, SEO, and lead generation for service providers.",
  "offering": "Advertising, Branding, Business Coaching, Business Consulting, Coach Marketing Training, Content Creation, Content Marketing, Copywriting, E-Commerce Marketing, Facebook Ads, Ghost Writers, Google Ads, Internet Marketing Expert, Lead Generation Specialists, Linkedin Marketing, Marketing Coach, Opt-In Page Creation, Presentation Skills, Public Speaking, Sales Training, SEO, Social Media Marketing, Webinar Training",
  "business_focus": "Provides comprehensive marketing services including branding, copywriting, and digital advertising. Offers sales training, SEO, and lead generation for service providers.",
  "audience_type": "Coaches, consultants, and service providers who need comprehensive done-for-you marketing across bra",
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/in/dwbegley",
    "youtube": "https://www.youtube.com/watch?v=byekY_tHFlI",
    "apple_podcast": "https://podcasts.apple.com/us/podcast/affiliate-marketing-radio/id1464007653"
  },
  "jv_history": [
    {
      "partner_name": "",
      "format": "affiliate",
      "source_quote": "this video Tyler and Darren AKA D-Money talk about the early days of affiliate marketing and the Player's Ball ... | view_count: 148 views | short_view_count: 148 views | num_likes: 6 likes | num_subs",
      "source_url": "https://www.youtube.com/watch?v=K-Hb0M0pzXI"
    }
  ],
  "audience_engagement_score": 0.55,
  "website": "https://affinitygrowthpartners.com/",
  "linkedin": "https://www.linkedin.com/in/darrensvision",
  "_cache_schema_version": 2
}