{
  "name": "Tara Ellis",
  "list_size": 0,
  "seeking": "Seeks JV partners who can refer or co-market to general business audiences needing professional services or business development support. Limited data suggests openness to cross-referral arrangements with professionals in complementary service areas.",
  "what_you_do": "Amazon best-selling author of sci-fi, mystery, and children's detective novels, and keynote speaker on topics of authorship, education, and literacy.",
  "business_focus": "Full-time author of sci-fi and mystery novels with a focus on children's and young adult literature, and public speaking on related topics.",
  "content_platforms": {
    "facebook": "https://www.facebook.com/taraellisauthor/",
    "linkedin": "https://www.linkedin.com/posts/tara-ellis-4556b48_please-join-me-for-writing-for-episodic-television-activity-7287164973242359809-K_bh",
    "tiktok": "https://www.tiktok.com/@elz_ibub"
  },
  "audience_engagement_score": 0.45,
  "social_reach": 1325,
  "website": "https://www.allamericanspeakers.com/speakers/460250/Tara-Ellis",
  "linkedin": "https://www.linkedin.com/in/tori-ellis-psyd-1a170a166",
  "_cache_schema_version": 2,
  "_phase2_enriched": true,
  "_phase2_date": "2026-02-18T06:59:10.220060",
  "who_you_serve": "Readers of sci-fi, mystery, and middle-grade children's books, as well as event organizers seeking speakers on authorship, education, and literacy.",
  "offering": "Keynote speaking engagements on authorship, education, and literacy; published book series across multiple genres.",
  "niche": "Children's Author",
  "bio": "Tara Ellis is an Amazon best-selling author living in a small, rural town in Washington State. She was a firefighter/EMT and worked in the medical field for many years before committing to writing full-time. She writes post-apocalyptic sci-fi, YA alternate history, and a popular middle-grade mystery series, The Samantha Wolf Mysteries.",
  "tags": [
    "author",
    "children's books",
    "sci-fi",
    "mystery",
    "education",
    "literacy",
    "keynote speaker"
  ],
  "audience_type": "B2C",
  "service_provided": "Keynote speaking, author appearances, virtual speaking engagements",
  "network_role": "Creator",
  "signature_programs": "Flashpoint series, Extinction series, After the Crash series, Forgotten Origins trilogy, The Samantha Wolf Mysteries series"
}