{
  "name": "Matt",
  "list_size": 0,
  "seeking": "Seeks JV partners who can provide cross-referrals or collaborative opportunities for coaching and consulting engagements. Limited data suggests openness to strategic partnerships that expand client reach and create mutual growth opportunities.",
  "who_you_serve": "Professionals and individuals seeking coaching and consulting services for personal or business advancement.",
  "audience_type": "B2B",
  "content_platforms": {
    "youtube": "https://www.youtube.com/@MattRifeComedy",
    "instagram": "https://www.instagram.com/mattrife/",
    "apple_podcast": "https://podcasts.apple.com/ca/podcast/outward-slates-lgbtq-podcast/id1425950706"
  },
  "audience_engagement_score": 0.6000000000000001,
  "social_reach": 4050000,
  "website": "https://www.matt-bird.com/",
  "_cache_schema_version": 2,
  "what_you_do": "Matt is a serial entrepreneur, high-impact communicator and coach who is renowned for his innovation and impact!",
  "social_proof": "The event was fully booked within four minutes. Super-insightful with members feedback described as engaging, resourceful and straight-to-the-point! Membership Manager, Soho House\nAn exceptional communicator who imparts insightful principles, practical skills and the belief that you can succeed! Chair, The Mandate Conference\nYour keynote was excellent; it's like you knew us inside out! Global General Counsel, PwC\nYou aren't like the usual diversity champion, so the people we needed to hear the message listened to every word you said! Director of Diversity and Inclusion, Federal Reserve Bank USA",
  "signature_programs": "The Writing My Book Course, Speaking, Masterclasses, Books",
  "niche": "speaker, author, coach",
  "company": "Matt Bird",
  "tags": [
    "speaker",
    "author",
    "coach"
  ],
  "business_focus": "Matt is a serial entrepreneur, high-impact communicator and coach who is renowned for his innovation and impact!",
  "service_provided": "speaking, masterclasses, books",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T03:29:09.318151"
}