{
  "name": "Valerie Lis",
  "list_size": 0,
  "seeking": "Valerie provides professional services and consulting, and given her business professional audience designation, she likely seeks JV partners who can refer clients needing specialized consulting or advisory support. She would be open to reciprocal referral or co-promotional arrangements with adjacent service providers targeting business professionals. A cross-referral or affiliate arrangement with a coach, trainer, or strategist serving the same professional audience is the most probable fit.",
  "what_you_do": "Intuitive career empowerment coaching, keynote speaking, and expert facilitation, supporting individuals in aligning their careers with their inner truth, core values, natural strengths, and life purpose.",
  "business_focus": "Supporting individuals in aligning their careers with their inner truth, core values, natural strengths, and life purpose through coaching, speaking, and facilitation.",
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/in/valerie-lis-5631bb4",
    "youtube": "https://www.youtube.com/c/LifewithValerieRose",
    "instagram": "https://www.instagram.com/popular/valerie-lisitsyna/"
  },
  "jv_history": [
    {
      "partner_name": "#wny #communityinvesting #liscny | Valerie White",
      "format": "endorsement",
      "source_quote": "erie White’s Post View profile for Valerie White \n Valerie White \n1yEdited ... Congrats Christine O'Connell and team #WNY #communityinvesting #LISCNY ... ### Advancing Corporate Diversity & Inclusion ",
      "source_url": "https://www.linkedin.com/posts/valerie-white-14590511_wny-communityinvesting-liscny-activity-7258805499884703744-DEHp"
    }
  ],
  "audience_engagement_score": 0.6000000000000001,
  "social_reach": 2530,
  "website": "https://www.valeriejlyonsenterprises.com/",
  "_cache_schema_version": 2,
  "_phase2_enriched": true,
  "_phase2_date": "2026-02-18T07:02:16.787398",
  "who_you_serve": "Individuals seeking to align their careers with their core values, natural strengths, and life purpose.",
  "niche": "Career empowerment coaching",
  "bio": "Valerie J. Lyons is an intuitive career empowerment coach, keynote speaker, and expert facilitator. She supports individuals in aligning their careers with their inner truth, core values, natural strengths, and life purpose. She is the author of Power Networking from the Inside Out: Where Your Career and Your Well-Being Meet.",
  "tags": [
    "career coaching",
    "keynote speaker",
    "facilitation",
    "networking",
    "career empowerment",
    "well-being"
  ],
  "audience_type": "B2C",
  "service_provided": "Career empowerment coaching, keynote speaking, expert facilitation",
  "network_role": "Educator",
  "signature_programs": "Power Networking from the Inside Out: Where Your Career and Your Well-Being Meet"
}