{
  "name": "Book Publishing",
  "company": "Bettina Carey",
  "list_size": 6192,
  "offering": ", Marketing Expert, Membership Platform, PR (Public Relations), PR Agency, Publishing Services, Speaking Opportunities, Sponsorship Training, TeleSummits, Video Marketing, Website Design, Website Hosting",
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/in/bettinacareyspeaker",
    "apple_podcast": "https://podcasts.apple.com/ie/podcast/episode-436-bettina-carey-shift-gears-and-break-your/id1231475990?i=1000567361551"
  },
  "website": "https://www.weempoweryourlife.com/217918/about-bettina.htm",
  "linkedin": "https://www.linkedin.com/in/bettinacareyspeaker",
  "_cache_schema_version": 2,
  "what_you_do": "Bettina Carey runs a boutique marketing agency, Bettina Carey Productions, which was founded in 2001 to help local businesses and non-profits redefine and reimagine their brands to reach their niche market.",
  "who_you_serve": "Bettina helps build, grow, and scale coaching and service-based businesses.",
  "social_proof": "Bettina has experience in marketing, branding, advertising, publishing, social media, video/photo/event production, promotions, research/surveys/data management, and email marketing. She has held roles such as Chief Marketing Officer, Project Manager, Senior Corporate Brand Strategist, VP of Sales, VP of Business Development, Marketing Director, Art Director, and Publicist. Bettina has a long history of community service, serving on several boards.",
  "signature_programs": "Bettina is the Founder of Women in Small Biz Shows & Events, which create powerful, memorable experiences that open doors full of possibilities for attendees.",
  "booking_link": "https://www.weempoweryourlife.com/275995/Book-A-Time.htm",
  "niche": "marketing, branding, business growth",
  "phone": "206.349.4297",
  "tags": [
    "marketing",
    "branding",
    "business growth",
    "community service"
  ],
  "audience_type": "coaches, entrepreneurs, service-based businesses",
  "business_focus": "Bettina Carey runs a boutique marketing agency that helps local businesses and non-profits redefine and reimagine their brands to reach their niche market.",
  "service_provided": "marketing, branding, advertising, publishing, social media, video/photo/event production, promotions, research/surveys/data management, email marketing",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T01:23:31.651591"
}