{
  "name": "Craig Elliot",
  "company": "The Weight Loss Frustration to",
  "list_size": 0,
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/posts/elliott-hulse-3997713_hey-its-elliott-ive-gained-and-lost-activity-7255254821866205184-pR4H",
    "youtube": "https://www.youtube.com/watch?v=l3S8blaNKag",
    "instagram": "https://www.instagram.com/p/CTXOcyDhe2d/",
    "tiktok": "https://www.tiktok.com/discover/craig-robinson-elliptical"
  },
  "audience_engagement_score": 0.65,
  "website": "https://weightlossfrustrationtofreedom.com/personal-bio/",
  "_cache_schema_version": 2,
  "what_you_do": "Craig Elliot has a specialized array of training, skills and experience in the area of people performance and behaviour modification. Craig is a qualified and experienced hypnotherapist and has been coaching, consulting and training people in their sporting, professional and personal lives for 15 years.",
  "who_you_serve": "Craig has consulted to gyms throughout Auckland, New Zealand in the area of weight management and exercise motivation and is the creator of the unique 'Weight loss frustration to freedom' solution and the 'Get the fat out of your head' concept which show people how to get their brain onside to lose weight and keep it off without it being a struggle.",
  "social_proof": "Craig has been interviewed himself by industry leaders such as Damian Kristof of the TV. show downsize me fame and Ben Warren the founder of Be-Pure health revolution. Craig was also invited to share his material at Damian kristofs 2011 Exclusive Wiaheke island weight loss retreat. Dr Gary Mendoza PhD, renowned Researcher & Lecturer in obesity and overweight and developer of the L.E.A.N. MAN weight loss system attended Craig's 6 module 'get the fat out of your head' course further highlighting the creditability and value of his message and material – even to other industry experts.",
  "signature_programs": "Craig has designed and presented motivational workshops to the RNZAF, presented his material to the PHO or primary health organizations throughout the Horowhenua, professionally presented a series of seminars to the Surgical Obesity Service in Wellington, New Zealand and run two day trainings for staff and leaders of ….Tewhanau Manakki – drug and alcohol rehabilitation organization. Craig is currently authoring a series of 5 books being published on Amazon kindle that address the 5 frustrations and corresponding milestones that move people from weight loss frustration to freedom.",
  "niche": "weight loss, behavior modification",
  "tags": [
    "weight loss",
    "behavior modification",
    "hypnotherapy",
    "coaching",
    "consulting",
    "training"
  ],
  "audience_type": "B2C",
  "business_focus": "Craig Elliot has a specialized array of training, skills and experience in the area of people performance and behaviour modification.",
  "service_provided": "coaching, consulting, training, hypnotherapy",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T02:41:33.256147"
}