{
  "name": "Naomi McKenna",
  "list_size": 0,
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/in/naomimckenna",
    "facebook": "https://www.facebook.com/naomi.mckee.9/",
    "tiktok": "https://www.tiktok.com/discover/mckenna-pregnant"
  },
  "jv_history": [
    {
      "partner_name": "Naomi McKenna - JV Affiliate Marketing Strategist",
      "format": "endorsement",
      "source_quote": "Naomi is a successful Partner Marketing Strategist with over 12 years of experience managing Joint Ventures for experts ... TOP 37 THINGS YOU’LL REGRET WHEN YOU’RE OLD\n\n## GitHub\n\n GitHub Profile \n\nUs",
      "source_url": "https://www.linkedin.com/in/naomimckenna"
    }
  ],
  "audience_engagement_score": 0.45,
  "website": "https://fourroomsmastermind.com/members/",
  "linkedin": "https://www.linkedin.com/in/naomimckenna",
  "_cache_schema_version": 2,
  "social_proof": "Dr. Michelle Sands is a highly sought after board certified Naturopathic Physician, Functional doctor, best-selling author and female hormone expert. Eddie Maalouf is the Founder & CEO of 4Media Marketing, one of the fastest-growing full-service E-commerce marketing agencies in the USA with over $600,000,000 per year in managed revenue. Tony Grebmeier is the Co-Founder/CEO of ShipOffers. Jim House is the Founder of The Book Carver. Haafiz Dossa is the CEO of Inflektion. Brannon Church is a Sales Engineer at ShipOffers. Pam Jordan is the President of Pivot Business Group. Aria Boushehri is the Founder of SalesBound. Justin Maxwell is the Managing Partner of Big Life Financial. Cody Jefferson is the Founder of Embrace The Lion. Grant Eilertson is the Founder of SimpleCheck and SmartForm. Brad Howard is the CEO of Results Ink. Roger Stewart is a Partner at Altum Risk & Insurance Solutions. Izabela Hamilton is the CEO & Founder of RankBell and Ink of Genius.",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T03:26:03.827359",
  "_phase2_enriched": true,
  "_phase2_date": "2026-02-18T06:06:05.482424",
  "what_you_do": "Naomi McKenna is a Partner Marketing Strategist specializing in Joint Venture and Affiliate Marketing management for experts and leaders in the Personal Development and Digital Marketing industries.",
  "who_you_serve": "Experts and leaders in the Personal and Business Development industries.",
  "offering": "Joint venture management, affiliate marketing strategy, and strategic partnership development.",
  "niche": "Joint Ventures",
  "bio": "Naomi McKenna is a Partner Marketing Strategist with over 12 years of experience managing Joint Ventures for experts and leaders in the Personal and Business Development industries. She is the Owner and Founder of Impact Inspired, LLC, and serves as Partner & Director of Joint Venture Division at Michael Curtis Media in Austin, Texas. Past clients include Marisa Murgatroyd, John Assaraf, Roland Frasier, Lisa Sasevich, T. Harv Eker, and Agora Financial.",
  "tags": [
    "joint ventures",
    "affiliate marketing",
    "partner marketing",
    "strategic partnerships",
    "personal development",
    "digital marketing"
  ],
  "audience_type": "Coaches/Consultants",
  "business_focus": "Managing joint venture and affiliate marketing collaborations for established experts and thought leaders.",
  "service_provided": "Joint venture management, affiliate marketing strategy, partner marketing, strategic partnership development",
  "network_role": "Connector"
}