{
  "name": "Master Habits - Shape Shifting",
  "company": "More Info",
  "list_size": 0,
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/pulse/master-your-habits-four-laws-behavior-change-mihir-vashi-prmjc",
    "youtube": "https://www.youtube.com/watch?v=DPRnrZH6weU"
  },
  "audience_engagement_score": 0.55,
  "website": "https://masterhabits.com/",
  "linkedin": "https://ca.linkedin.com/in/michele-drake-master-habits",
  "_cache_schema_version": 2,
  "what_you_do": "Transform your body and revitalize your spirit through a safe and proven approach to release 1/2-2lbs daily.",
  "who_you_serve": "The website does not explicitly state the target audience.",
  "seeking": "The website does not explicitly state any partnerships or collaborations they are actively looking for.",
  "offering": "The website does not explicitly state any offerings to partners or collaborators.",
  "social_proof": "The website mentions that Michele is a distinguished Holistic Makeover Specialist with over 35 years of experience in alternative health and fitness, and that she is a certified personal trainer, life coach, fitness coach, and yoga instructor.",
  "signature_programs": "The website does not explicitly mention any named courses, books, frameworks, or certifications.",
  "booking_link": "The website does not provide a direct booking link.",
  "niche": "weight loss, fitness, wellness",
  "phone": "The website does not display a business phone number.",
  "tags": [
    "weight loss",
    "fitness",
    "wellness",
    "holistic",
    "personal training",
    "life coaching",
    "yoga"
  ],
  "audience_type": "The website does not explicitly state the type of audience they serve.",
  "business_focus": "Transform your body and revitalize your spirit through a safe and proven approach to weight loss.",
  "service_provided": "Personal training, life coaching, fitness coaching, yoga instruction",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T02:26:43.890714"
}