{
  "name": "Ritamarie Loscalzo",
  "list_size": 0,
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/in/drritamarie",
    "apple_podcast": "https://podcasts.apple.com/ch/podcast/reclaim-your-energy-using-functional-medicine-with-dr/id1538654652?i=1000689710176",
    "facebook": "https://www.facebook.com/DrRitamarie/",
    "instagram": "https://www.instagram.com/p/DGEZN_mSkk1/?hl=en"
  },
  "jv_history": [
    {
      "partner_name": "Dr. Ritamarie Loscalzo - Institute of Nutritional Endocrinology",
      "format": "summit_speaker",
      "source_quote": "calzo Founder: Institute of Nutritional Endocrinology | Keynote Speaker | Breakout Session Leader |On Stage",
      "source_url": "https://www.linkedin.com/in/drritamarie"
    }
  ],
  "audience_engagement_score": 0.45,
  "website": "https://inemethod.com/about/",
  "_cache_schema_version": 2,
  "what_you_do": "Dr. Ritamarie Loscalzo is a licensed Doctor of Chiropractic & Functional Nutrition Coach who specializes in using the wisdom of nature to restore balance to hormones with a special emphasis on thyroid, adrenal, and insulin imbalances.",
  "who_you_serve": "Health and wellness professionals - doctors, nurses, nutritionists, health coaches and others.",
  "offering": "Dr. Ritamarie offers online programs, long-distance coaching and counseling, and live events. She also has a practitioner certification program through the Institute of Nutritional Endocrinology to empower health and wellness professionals.",
  "social_proof": "Dr. Ritamarie is a best-selling author, speaker, and internationally recognized nutrition and women's health authority with over 32 years of clinical experience. She has been a featured speaker for dozens of online summits, podcasts, and events, and her articles have appeared in many national magazines as well as countless online publications.",
  "signature_programs": "Dr. Ritamarie's popular practitioner certification program, offered through the Institute of Nutritional Endocrinology, empowers health and wellness professionals to unravel the mystery of their clients' complex health challenges.",
  "niche": "functional nutrition, hormonal balance",
  "company": "Institute of Nutritional Endocrinology",
  "tags": [
    "functional nutrition",
    "hormonal balance",
    "thyroid",
    "adrenal",
    "insulin"
  ],
  "audience_type": "health and wellness professionals",
  "business_focus": "Transforming the current disease-focused system into a true health care system where all practitioners are skilled at finding the root cause of health challenges and using ancient healing wisdom married with modern scientific research to restore balance.",
  "service_provided": "online programs, long-distance coaching and counseling, live events, practitioner certification program",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T03:17:40.110451"
}