{
  "name": "Karen Putz",
  "company": "Ageless Passions",
  "list_size": 12361,
  "what_you_do": "Karen Putz is a transformational speaker and life coach specializing in helping individuals unwrap their passions at any age. She is also the owner of The Passion School and a certified Passion Test Facilitator.",
  "who_you_serve": "Karen serves individuals seeking personal growth and passion discovery, including those in midlife and beyond, as well as audiences of all sizes.",
  "niche": "life coaching",
  "signature_programs": "Unwrapping Your Passion, Creating the Life You Truly Want, The Passionate Lives of Deaf and Hard of Hearing People, and several others.",
  "service_provided": "1:1 coaching, group programs, speaking, courses",
  "phone": "630-405-6262",
  "business_size": "solo",
  "tags": [
    "life coaching",
    "passion mentoring",
    "public speaking",
    "deaf advocacy",
    "personal growth",
    "education",
    "water skiing"
  ],
  "email": "karen@agelesspassions.com",
  "bio": "17X author, featured in Ability magazine, MORE magazine, espnW, CNN, TODAY Show, and recipient of the Hot Momma Award for Sports, Wellness and Fitness.",
  "business_focus": "Karen Putz is a transformational speaker and life coach specializing in helping individuals unwrap their passions at any age. She is also the owner of The Passion School and a certified Passion Test Facilitator. (life coaching)",
  "audience_type": "B2C",
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/company/the-passion-school",
    "facebook": "https://www.facebook.com/karen.putz/",
    "youtube": "https://www.youtube.com/watch?v=j4U-rUJsa44&feature=youtu.be"
  },
  "jv_history": [
    {
      "partner_name": "Karen Guth Interview with Ron Jones Mar 24 2014",
      "format": "endorsement",
      "source_quote": "Guth, of the English Teaching with Creativity ETC, blog, interviews Ron Jones on Passion and Love- the keys to ... former students, his writing, coaching, activism and family. A must see for teachers ",
      "source_url": "https://www.youtube.com/watch?v=j4U-rUJsa44&feature=youtu.be"
    }
  ],
  "audience_engagement_score": 0.6000000000000001,
  "website": "https://www.agelesspassions.com/",
  "linkedin": "https://www.linkedin.com/in/agelesspassions"
}