{
  "name": "Tammy Workman",
  "list_size": 0,
  "seeking": "Seeks JV partners who can refer or collaborate on opportunities involving professional clients seeking consulting, business, or service-oriented support. Limited profile data suggests openness to referral-based partnerships with complementary professionals.",
  "content_platforms": {
    "facebook": "https://m.facebook.com/teamupwithtammy/about/",
    "linkedin": "https://www.linkedin.com/posts/tammywhyman_amazonwebservices-telco-globalpartner-activity-6976547795063222273-B3gA"
  },
  "jv_history": [
    {
      "partner_name": "#amazonwebservices #telco #globalpartner #innovation #happy | Tammy Whyman | 123 comments",
      "format": "endorsement",
      "source_quote": "Whyman’s Post\n\n Tammy Whyman Global Head of Partnerships at AWS-Telco industry \\| Growth \\| GenAI \\| Strategy and Transformation\n\n2y ... I’m happy to share that I’m starting a new position as Global P",
      "source_url": "https://www.linkedin.com/posts/tammywhyman_amazonwebservices-telco-globalpartner-activity-6976547795063222273-B3gA"
    }
  ],
  "audience_engagement_score": 0.4,
  "website": "https://www.behavioralessentials.com/coach/tammy-workman-lopez",
  "_cache_schema_version": 2,
  "what_you_do": "Tammy Workman-Lopez is a senior leadership coach who specializes in mindset development and behavioral insight to support leaders in navigating complex transitions, high-stakes environments, and people challenges with greater clarity and confidence.",
  "who_you_serve": "Tammy has coached leaders across healthcare, education, nonprofit, and entrepreneurial sectors, including senior leaders, small business CEOs, and high-potential professionals stepping into larger roles.",
  "social_proof": "Tammy holds certifications in the E3 Behavioral Assessment and Blindspotting frameworks through Behavioral Essentials, as well as in programs like Mind Power and Magnetic Mind. She is also a published author and contributor to several collaborative works, including titles that have reached the New York Times bestseller list.",
  "signature_programs": "E3 Behavioral Assessment, Blindspotting",
  "niche": "leadership coaching",
  "company": "Behavioral Essentials",
  "tags": [
    "leadership coaching",
    "mindset development",
    "behavioral insight",
    "executive coaching",
    "team facilitation",
    "organizational development"
  ],
  "audience_type": "B2B",
  "business_focus": "Tammy Workman-Lopez is a senior leadership coach who specializes in mindset development and behavioral insight to support leaders in navigating complex transitions, high-stakes environments, and people challenges.",
  "service_provided": "leadership coaching, executive coaching, team facilitation, organizational development",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T03:30:08.285767"
}