{
  "name": "Andrea Putting",
  "company": "Putting Words",
  "list_size": 13872,
  "offering": "Amazon Best Seller Campaigns, Book Cover Design, Book Editing and Layout, Book Publishing, Compilation Books, Presentation Skills, Public Speaking, Publishing Services, Speaking Opportunities",
  "content_platforms": {
    "apple_podcast": "https://podcasts.apple.com/gy/podcast/the-perfectionists-guide-to-mothering-with/id1514529622",
    "youtube": "https://www.youtube.com/watch?v=iMSjKE6TZhE",
    "linkedin": "https://www.linkedin.com/pulse/5-simply-powerful-words-change-your-life-madeline-schmidt-m-s-",
    "facebook": "https://www.facebook.com/AndreaGibsonPoetry/posts/in-todays-newsletter-i-share-a-new-poem-and-open-up-about-a-challenging-time-ive/1200022308150929/"
  },
  "audience_engagement_score": 0.6000000000000001,
  "website": "https://andreaputting.com.au/",
  "_cache_schema_version": 2,
  "what_you_do": "Andrea Putting is a speaker, author, podcast host, and compassion curator who helps audiences lead with love through keynotes, facilitated sessions, and leadership advisory.",
  "who_you_serve": "Andrea works with individuals, communities, and visionary teams to reimagine leadership through compassion, connection, and collaboration.",
  "social_proof": "Andrea is a bestselling author, Toastmaster of the Year (2016), and recipient of multiple global honors from Speakers Tribe and the Innov8 Wordsmith Award (2021).",
  "signature_programs": "Andrea's signature programs include the Social Mission Revolution podcast, Chocolate & Coffee Day for Religious Harmony, and 5 bestselling books: Awakened Stealth Leadership, Compassionate Purpose, Compassionate Prosperity, Brewing Compassion, and Moment of Infinity.",
  "niche": "compassionate leadership",
  "tags": [
    "speaker",
    "author",
    "podcast host",
    "compassion curator"
  ],
  "audience_type": "individuals, communities, visionary teams",
  "business_focus": "Andrea helps audiences trade volume for value through keynotes, storytelling, and intimate Chocolate & Coffee Breaks, cultivating Authentic Influence grounded in values and expressed through action.",
  "service_provided": "keynotes, Chocolate & Coffee Break facilitation, leadership labs and advisory, publishing support",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T01:10:24.810848"
}