{
  "name": "Takara Shelor",
  "company": "Amazon Best Sel",
  "list_size": 28500,
  "offering": "5,700ler Campaigns, Book Editing and Layout, Book Launches, Book Marketing, Book Publishing, Book Publishing Classes, Book Writing Coach, Expert Directory, Intuition Coaching, Publishing Services, Spiritual Coaching, Website Design",
  "content_platforms": {
    "facebook": "https://www.facebook.com/groups/ColoringBooksForAdults/posts/4058208134460108/",
    "tiktok": "https://www.tiktok.com/discover/best-sellers-amazon-2025",
    "apple_podcast": "https://podcasts.apple.com/us/podcast/shelor-select/id1544008589",
    "youtube": "https://www.youtube.com/watch?v=240nMLOjU7A"
  },
  "audience_engagement_score": 0.65,
  "website": "https://www.magnificentu.com/",
  "_cache_schema_version": 2,
  "what_you_do": "Provides energy healing tools, transformational coaching, and spiritual development programs to help people grow personally and spiritually.",
  "who_you_serve": "Individuals seeking personal and spiritual transformation, empowerment, and enlightenment.",
  "social_proof": "4-time bestselling author; endorsed by Jack Canfield (co-author of Chicken Soup for the Soul series and featured teacher in The Secret)",
  "signature_programs": "Dancing Dolphin Flower Essences & Gem Essences, Dancing Dolphin Way Energy Healing eCourse, Magnificent U Meditation Program, Manifesting Mastery Course (Law of Attraction), Pendulum Dowsing for Divine Direction, Heart of the Goddess, Sacred Circle (Women's Goddess Circle), Seed of Divine Restoration Energy Healing Sessions, Diamond Within Personal Mastery Energy Healing Sessions, Forgiveness Program, 7 Secrets to Discovering Your Inner Treasure (free ebook), Peering Through the Veil (book), Dolphins & Whales Forever (book), Unleash Your Future (book), Courage to Leave Courage to Live (book)",
  "niche": "Energy healing",
  "tags": [
    "energy healing",
    "spiritual transformation",
    "bestselling author",
    "dolphin energy healing",
    "flower essences",
    "meditation",
    "law of attraction"
  ],
  "audience_type": "B2C",
  "business_focus": "Helping individuals transform personally and spiritually through energy healing tools, books, courses, and private coaching sessions.",
  "service_provided": "Private energy healing sessions, transformational consulting, online courses, flower essences and gem essences, bestselling books, guided meditations, women's goddess circle",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T00:37:19.648423"
}