{
  "name": "Brooke Emery",
  "company": "Link Lab Agency",
  "list_size": 10000,
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/posts/brooke-emery-9082289a_teamseyfarth-activity-7379381727024062464-tYei",
    "apple_podcast": "https://podcasts.apple.com/pa/podcast/how-i-ai/id1804715823"
  },
  "jv_history": [
    {
      "partner_name": "Two agency owners, one shared vision: finding a partner with the tech and tools their agencies neede",
      "format": "endorsement",
      "source_quote": "agency owners, one shared vision: finding a partner with the tech and tools their agencies needed to thrive. When Brock Emery (CEO, Emery Insurance Group, LLC ) and[Dustin",
      "source_url": "https://www.linkedin.com/posts/spark._partnering-with-principals-to-build-telephonic-activity-7350917095997464576-IGtx"
    }
  ],
  "website": "https://www.ellieshefi.com/brooke-emery-on-embracing-a-do-good-have-fun-philosophy",
  "_cache_schema_version": 2,
  "what_you_do": "She is a creative business strategist with roots in advertising, publicity and film, recognized by Forbes Magazine as a connector. She is on a mission to change the traditional joint venture and affiliate marketing models.",
  "who_you_serve": "She works with personal development speakers, health and wellness authors as well as conscious entrepreneurs.",
  "seeking": "She is looking to create business development strategies that elevate profits and amplify social impact through aligned and heart-centered collaborations.",
  "offering": "She is the Cofounder of Link Lab, a joint venture and affiliate management agency that highlights its client's unique gifts and gets its message out to the masses.",
  "social_proof": "She is recognized by Forbes Magazine as a connector.",
  "signature_programs": "She is the creator of the Self Love and Self Care Community, which teaches people how to love and care for themselves more consciously so they can shine brighter in the world.",
  "niche": "business strategy, joint ventures, affiliate marketing",
  "tags": [
    "business strategy",
    "joint ventures",
    "affiliate marketing",
    "conscious entrepreneurs"
  ],
  "audience_type": "personal development speakers, health and wellness authors, conscious entrepreneurs",
  "business_focus": "She is on a mission to change the traditional joint venture and affiliate marketing models by using her vast global network to create business development strategies that elevate profits and amplify social impact through aligned and heart-centered collaborations.",
  "service_provided": "business strategy, joint venture management, affiliate marketing",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T01:15:12.937992"
}