{
  "name": "Marie Kane",
  "company": "Relationships",
  "list_size": 0,
  "content_platforms": {
    "linkedin": "https://www.linkedin.com/in/marie-kane-b364281",
    "youtube": "https://www.youtube.com/watch?v=HsJmNqHSppI",
    "facebook": "https://www.facebook.com/kanecountychronicle/posts/an-18-year-old-from-geneva-died-sunday-after-an-eastbound-freight-train-struck-h/1509530161178727/",
    "tiktok": "https://www.tiktok.com/@kanepadams"
  },
  "audience_engagement_score": 0.65,
  "website": "https://www.yourtango.com/experts/mariekane",
  "linkedin": "https://www.linkedin.com/in/marie-kane-b364281",
  "_cache_schema_version": 2,
  "what_you_do": "I have been helping women and men create positive, successful, fulfilling relationships at home and at work as a marriage counselor and family therapist, as a corporate consultant and as a relationship coach for over 40 years.",
  "who_you_serve": "I have been helping women and men create positive, successful, fulfilling relationships at home and at work",
  "social_proof": "I am the creator of Relationship Magic for Couples, 2016, based on proven processes used in both therapeutic and corporate environments. I am also the creator of the Teams Evolving and Mastering Success assessment and improvement process for small business and teams. I'm the author of inspirational books, as well as numerous articles on leadership and other topics in both national and international publications.",
  "signature_programs": "Relationship Magic for Couples",
  "niche": "relationship coaching",
  "tags": [
    "relationship coaching",
    "conflict resolution",
    "couples counseling",
    "marriage counseling",
    "corporate consulting",
    "team building",
    "executive coaching"
  ],
  "audience_type": "B2C, B2B",
  "business_focus": "Helping women and men create positive, successful, fulfilling relationships at home and at work through relationship coaching, conflict resolution, and corporate consulting.",
  "service_provided": "Relationship Coaching, Conflict Resolution for Couples, Conflict Resolution for Managers and Executives, Relationship Management for Managers and Executives, Team Building, Executive Coaching",
  "_crawl4ai_enriched": true,
  "_crawl4ai_timestamp": "2026-02-18T02:01:42.826271"
}